BitNibble/Source_Library/stm32fxxxlib/Library/Src/stm32fxxxdma.c
	// CR
	stm32fxxx_dma1_stream1_cr.chsel = STM32FXXXDMA1_stream1_cr_chsel;
	stm32fxxx_dma1_stream1_cr.mburst = STM32FXXXDMA1_stream1_cr_mburst;
	stm32fxxx_dma1_stream1_cr.pburst = STM32FXXXDMA1_stream1_cr_pburst;
	stm32fxxx_dma1_stream1_cr.ct = STM32FXXXDMA1_stream1_cr_ct;
	stm32fxxx_dma1_stream1_cr.dbm = STM32FXXXDMA1_stream1_cr_dbm;
	stm32fxxx_dma1_stream1_cr.pl = STM32FXXXDMA1_stream1_cr_pl;
	stm32fxxx_dma1_stream1_cr.pincos = STM32FXXXDMA1_stream1_cr_pincos;
	stm32fxxx_dma1_stream1_cr.msize = STM32FXXXDMA1_stream1_cr_msize;
	stm32fxxx_dma1_stream1_cr.psize = STM32FXXXDMA1_stream1_cr_psize;
	stm32fxxx_dma1_stream1_cr.minc = STM32FXXXDMA1_stream1_cr_minc;
	stm32fxxx_dma1_stream1_cr.pinc = STM32FXXXDMA1_stream1_cr_pinc;
	stm32fxxx_dma1_stream1_cr.circ = STM32FXXXDMA1_stream1_cr_circ;
	stm32fxxx_dma1_stream1_cr.dir = STM32FXXXDMA1_stream1_cr_dir;
	stm32fxxx_dma1_stream1_cr.pfctrl = STM32FXXXDMA1_stream1_cr_pfctrl;
	stm32fxxx_dma1_stream1_cr.tcie = STM32FXXXDMA1_stream1_cr_tcie;
	stm32fxxx_dma1_stream1_cr.htie = STM32FXXXDMA1_stream1_cr_htie;
	stm32fxxx_dma1_stream1_cr.teie = STM32FXXXDMA1_stream1_cr_teie;
	stm32fxxx_dma1_stream1_cr.dmeie = STM32FXXXDMA1_stream1_cr_dmeie;
	stm32fxxx_dma1_stream1_cr.en = STM32FXXXDMA1_stream1_cr_en;
	return &stm32fxxx_dma1_stream1_cr;
}
/*** Inic DMA1 STREAM1 Function ***/
void stm32fxxx_dma1_stream1_ndt(uint16_t value)
{
	DMA1_Stream1->NDTR = value;
}
void stm32fxxx_dma1_stream1_par(volatile long unsigned int periferal_addr)
{
	DMA1_Stream1->PAR = periferal_addr;
}
void stm32fxxx_dma1_stream1_m0a(volatile long unsigned int mem0_addr)
{
	DMA1_Stream1->M0AR = mem0_addr;
}
void stm32fxxx_dma1_stream1_m1a(volatile long unsigned int mem1_addr)
{
	DMA1_Stream1->M1AR = mem1_addr;
}
// DMA1 STREAM2 CR
void STM32FXXXDMA1_stream2_cr_chsel(uint8_t value)
{
	setreg(&DMA1_Stream2->CR, 3, 25, value);
}
void STM32FXXXDMA1_stream2_cr_mburst(uint8_t value)
{
	setreg(&DMA1_Stream2->CR, 2, 23, value);
}
void STM32FXXXDMA1_stream2_cr_pburst(uint8_t value)
{
	setreg(&DMA1_Stream2->CR, 2, 21, value);
}
void STM32FXXXDMA1_stream2_cr_ct(uint8_t bool)
{
	setreg(&DMA1_Stream2->CR, 1, 19, bool);
}
void STM32FXXXDMA1_stream2_cr_dbm(uint8_t bool)
{
	setreg(&DMA1_Stream2->CR, 1, 18, bool);
}
void STM32FXXXDMA1_stream2_cr_pl(uint8_t value)
{
	setreg(&DMA1_Stream2->CR, 2, 16, value);
}
void STM32FXXXDMA1_stream2_cr_pincos(uint8_t bool)
{
	setreg(&DMA1_Stream2->CR, 1, 15, bool);
}
void STM32FXXXDMA1_stream2_cr_msize(uint8_t value)
{
	setreg(&DMA1_Stream2->CR, 2, 13, value);
}
void STM32FXXXDMA1_stream2_cr_psize(uint8_t value)
{
	setreg(&DMA1_Stream2->CR, 2, 11, value);
}
void STM32FXXXDMA1_stream2_cr_minc(uint8_t bool)
{
	setreg(&DMA1_Stream2->CR, 1, 10, bool);
}
void STM32FXXXDMA1_stream2_cr_pinc(uint8_t bool)
{
	setreg(&DMA1_Stream2->CR, 1, 9, bool);
}
void STM32FXXXDMA1_stream2_cr_circ(uint8_t bool)
{
	setreg(&DMA1_Stream2->CR, 1, 8, bool);
}
void STM32FXXXDMA1_stream2_cr_dir(uint8_t value)
{
	setreg(&DMA1_Stream2->CR, 2, 7, value);
}
void STM32FXXXDMA1_stream2_cr_pfctrl(uint8_t bool)
{
	setreg(&DMA1_Stream2->CR, 1, 5, bool);
}
void STM32FXXXDMA1_stream2_cr_tcie(uint8_t bool)
{
	setreg(&DMA1_Stream2->CR, 1, 4, bool);
}
void STM32FXXXDMA1_stream2_cr_htie(uint8_t bool)
{
	setreg(&DMA1_Stream2->CR, 1, 3, bool);
}
void STM32FXXXDMA1_stream2_cr_teie(uint8_t bool)
{
	setreg(&DMA1_Stream2->CR, 1, 2, bool);
}
void STM32FXXXDMA1_stream2_cr_dmeie(uint8_t bool)
{
	setreg(&DMA1_Stream2->CR, 1, 1, bool);
}
void STM32FXXXDMA1_stream2_cr_en(uint8_t bool)
{
	setreg(&DMA1_Stream2->CR, 1, 0, bool);
}
/*** Inic DMA1 STREAM2 CR ***/
STM32FXXXDMA_STREAM_cr* stm32fxxx_dma1_stream2_cr_inic(void)
{

	// CR
	stm32fxxx_dma1_stream2_cr.chsel = STM32FXXXDMA1_stream2_cr_chsel;
	stm32fxxx_dma1_stream2_cr.mburst = STM32FXXXDMA1_stream2_cr_mburst;
	stm32fxxx_dma1_stream2_cr.pburst = STM32FXXXDMA1_stream2_cr_pburst;
	stm32fxxx_dma1_stream2_cr.ct = STM32FXXXDMA1_stream2_cr_ct;
	stm32fxxx_dma1_stream2_cr.dbm = STM32FXXXDMA1_stream2_cr_dbm;
	stm32fxxx_dma1_stream2_cr.pl = STM32FXXXDMA1_stream2_cr_pl;
	stm32fxxx_dma1_stream2_cr.pincos = STM32FXXXDMA1_stream2_cr_pincos;
	stm32fxxx_dma1_stream2_cr.msize = STM32FXXXDMA1_stream2_cr_msize;
	stm32fxxx_dma1_stream2_cr.psize = STM32FXXXDMA1_stream2_cr_psize;
	stm32fxxx_dma1_stream2_cr.minc = STM32FXXXDMA1_stream2_cr_minc;
	stm32fxxx_dma1_stream2_cr.pinc = STM32FXXXDMA1_stream2_cr_pinc;
	stm32fxxx_dma1_stream2_cr.circ = STM32FXXXDMA1_stream2_cr_circ;
	stm32fxxx_dma1_stream2_cr.dir = STM32FXXXDMA1_stream2_cr_dir;
	stm32fxxx_dma1_stream2_cr.pfctrl = STM32FXXXDMA1_stream2_cr_pfctrl;
	stm32fxxx_dma1_stream2_cr.tcie = STM32FXXXDMA1_stream2_cr_tcie;
	stm32fxxx_dma1_stream2_cr.htie = STM32FXXXDMA1_stream2_cr_htie;
	stm32fxxx_dma1_stream2_cr.teie = STM32FXXXDMA1_stream2_cr_teie;
	stm32fxxx_dma1_stream2_cr.dmeie = STM32FXXXDMA1_stream2_cr_dmeie;
	stm32fxxx_dma1_stream2_cr.en = STM32FXXXDMA1_stream2_cr_en;
	return &stm32fxxx_dma1_stream2_cr;
}
/*** Inic DMA1 STREAM2 Function ***/
void stm32fxxx_dma1_stream2_ndt(uint16_t value)
{
	DMA1_Stream2->NDTR = value;
}
void stm32fxxx_dma1_stream2_par(volatile long unsigned int periferal_addr)
{
	DMA1_Stream2->PAR = periferal_addr;
}
void stm32fxxx_dma1_stream2_m0a(volatile long unsigned int mem0_addr)
{
	DMA1_Stream2->M0AR = mem0_addr;
}
void stm32fxxx_dma1_stream2_m1a(volatile long unsigned int mem1_addr)
{
	DMA1_Stream2->M1AR = mem1_addr;
}
// DMA1 STREAM3 CR
void STM32FXXXDMA1_stream3_cr_chsel(uint8_t value)
{
	setreg(&DMA1_Stream3->CR, 3, 25, value);
}
void STM32FXXXDMA1_stream3_cr_mburst(uint8_t value)
{
	setreg(&DMA1_Stream3->CR, 2, 23, value);
}
void STM32FXXXDMA1_stream3_cr_pburst(uint8_t value)
{
	setreg(&DMA1_Stream3->CR, 2, 21, value);
}
void STM32FXXXDMA1_stream3_cr_ct(uint8_t bool)
{
	setreg(&DMA1_Stream3->CR, 1, 19, bool);
}
void STM32FXXXDMA1_stream3_cr_dbm(uint8_t bool)
{
	setreg(&DMA1_Stream3->CR, 1, 18, bool);
}
void STM32FXXXDMA1_stream3_cr_pl(uint8_t value)
{
	setreg(&DMA1_Stream3->CR, 2, 16, value);
}
void STM32FXXXDMA1_stream3_cr_pincos(uint8_t bool)
{
	setreg(&DMA1_Stream3->CR, 1, 15, bool);
}
void STM32FXXXDMA1_stream3_cr_msize(uint8_t value)
{
	setreg(&DMA1_Stream3->CR, 2, 13, value);
}
void STM32FXXXDMA1_stream3_cr_psize(uint8_t value)
{
	setreg(&DMA1_Stream3->CR, 2, 11, value);
}
void STM32FXXXDMA1_stream3_cr_minc(uint8_t bool)
{
	setreg(&DMA1_Stream3->CR, 1, 10, bool);
}
void STM32FXXXDMA1_stream3_cr_pinc(uint8_t bool)
{
	setreg(&DMA1_Stream3->CR, 1, 9, bool);
}
void STM32FXXXDMA1_stream3_cr_circ(uint8_t bool)
{
	setreg(&DMA1_Stream3->CR, 1, 8, bool);
}
void STM32FXXXDMA1_stream3_cr_dir(uint8_t value)
{
	setreg(&DMA1_Stream3->CR, 2, 7, value);
}
void STM32FXXXDMA1_stream3_cr_pfctrl(uint8_t bool)
{
	setreg(&DMA1_Stream3->CR, 1, 5, bool);
}
void STM32FXXXDMA1_stream3_cr_tcie(uint8_t bool)
{
	setreg(&DMA1_Stream3->CR, 1, 4, bool);
}
void STM32FXXXDMA1_stream3_cr_htie(uint8_t bool)
{
	setreg(&DMA1_Stream3->CR, 1, 3, bool);
}
void STM32FXXXDMA1_stream3_cr_teie(uint8_t bool)
{
	setreg(&DMA1_Stream3->CR, 1, 2, bool);
}
void STM32FXXXDMA1_stream3_cr_dmeie(uint8_t bool)
{
	setreg(&DMA1_Stream3->CR, 1, 1, bool);
}
void STM32FXXXDMA1_stream3_cr_en(uint8_t bool)
{
	setreg(&DMA1_Stream3->CR, 1, 0, bool);
}
/*** Inic DMA1 STREAM3 CR ***/
STM32FXXXDMA_STREAM_cr* stm32fxxx_dma1_stream3_cr_inic(void)
{

	// CR
	stm32fxxx_dma1_stream3_cr.chsel = STM32FXXXDMA1_stream3_cr_chsel;
	stm32fxxx_dma1_stream3_cr.mburst = STM32FXXXDMA1_stream3_cr_mburst;
	stm32fxxx_dma1_stream3_cr.pburst = STM32FXXXDMA1_stream3_cr_pburst;
	stm32fxxx_dma1_stream3_cr.ct = STM32FXXXDMA1_stream3_cr_ct;
	stm32fxxx_dma1_stream3_cr.dbm = STM32FXXXDMA1_stream3_cr_dbm;
	stm32fxxx_dma1_stream3_cr.pl = STM32FXXXDMA1_stream3_cr_pl;
	stm32fxxx_dma1_stream3_cr.pincos = STM32FXXXDMA1_stream3_cr_pincos;
	stm32fxxx_dma1_stream3_cr.msize = STM32FXXXDMA1_stream3_cr_msize;
	stm32fxxx_dma1_stream3_cr.psize = STM32FXXXDMA1_stream3_cr_psize;
	stm32fxxx_dma1_stream3_cr.minc = STM32FXXXDMA1_stream3_cr_minc;
	stm32fxxx_dma1_stream3_cr.pinc = STM32FXXXDMA1_stream3_cr_pinc;
	stm32fxxx_dma1_stream3_cr.circ = STM32FXXXDMA1_stream3_cr_circ;
	stm32fxxx_dma1_stream3_cr.dir = STM32FXXXDMA1_stream3_cr_dir;
	stm32fxxx_dma1_stream3_cr.pfctrl = STM32FXXXDMA1_stream3_cr_pfctrl;
	stm32fxxx_dma1_stream3_cr.tcie = STM32FXXXDMA1_stream3_cr_tcie;
	stm32fxxx_dma1_stream3_cr.htie = STM32FXXXDMA1_stream3_cr_htie;
	stm32fxxx_dma1_stream3_cr.teie = STM32FXXXDMA1_stream3_cr_teie;
	stm32fxxx_dma1_stream3_cr.dmeie = STM32FXXXDMA1_stream3_cr_dmeie;
	stm32fxxx_dma1_stream3_cr.en = STM32FXXXDMA1_stream3_cr_en;
	return &stm32fxxx_dma1_stream3_cr;
}
/*** Inic DMA1 STREAM3 Function ***/
void stm32fxxx_dma1_stream3_ndt(uint16_t value)
{
	DMA1_Stream3->NDTR = value;
}
void stm32fxxx_dma1_stream3_par(volatile long unsigned int periferal_addr)
{
	DMA1_Stream3->PAR = periferal_addr;
}
void stm32fxxx_dma1_stream3_m0a(volatile long unsigned int mem0_addr)
{
	DMA1_Stream3->M0AR = mem0_addr;
}
void stm32fxxx_dma1_stream3_m1a(volatile long unsigned int mem1_addr)
{
	DMA1_Stream3->M1AR = mem1_addr;
}
// DMA1 STREAM4 CR
void STM32FXXXDMA1_stream4_cr_chsel(uint8_t value)
{
	setreg(&DMA1_Stream4->CR, 3, 25, value);
}
void STM32FXXXDMA1_stream4_cr_mburst(uint8_t value)
{
	setreg(&DMA1_Stream4->CR, 2, 23, value);
}
void STM32FXXXDMA1_stream4_cr_pburst(uint8_t value)
{
	setreg(&DMA1_Stream4->CR, 2, 21, value);
}
void STM32FXXXDMA1_stream4_cr_ct(uint8_t bool)
{
	setreg(&DMA1_Stream4->CR, 1, 19, bool);
}
void STM32FXXXDMA1_stream4_cr_dbm(uint8_t bool)
{
	setreg(&DMA1_Stream4->CR, 1, 18, bool);
}
void STM32FXXXDMA1_stream4_cr_pl(uint8_t value)
{
	setreg(&DMA1_Stream4->CR, 2, 16, value);
}
void STM32FXXXDMA1_stream4_cr_pincos(uint8_t bool)
{
	setreg(&DMA1_Stream4->CR, 1, 15, bool);
}
void STM32FXXXDMA1_stream4_cr_msize(uint8_t value)
{
	setreg(&DMA1_Stream4->CR, 2, 13, value);
}
void STM32FXXXDMA1_stream4_cr_psize(uint8_t value)
{
	setreg(&DMA1_Stream4->CR, 2, 11, value);
}
void STM32FXXXDMA1_stream4_cr_minc(uint8_t bool)
{
	setreg(&DMA1_Stream4->CR, 1, 10, bool);
}
void STM32FXXXDMA1_stream4_cr_pinc(uint8_t bool)
{
	setreg(&DMA1_Stream4->CR, 1, 9, bool);
}
void STM32FXXXDMA1_stream4_cr_circ(uint8_t bool)
{
	setreg(&DMA1_Stream4->CR, 1, 8, bool);
}
void STM32FXXXDMA1_stream4_cr_dir(uint8_t value)
{
	setreg(&DMA1_Stream4->CR, 2, 7, value);
}
void STM32FXXXDMA1_stream4_cr_pfctrl(uint8_t bool)
{
	setreg(&DMA1_Stream4->CR, 1, 5, bool);
}
void STM32FXXXDMA1_stream4_cr_tcie(uint8_t bool)
{
	setreg(&DMA1_Stream4->CR, 1, 4, bool);
}
void STM32FXXXDMA1_stream4_cr_htie(uint8_t bool)
{
	setreg(&DMA1_Stream4->CR, 1, 3, bool);
}
void STM32FXXXDMA1_stream4_cr_teie(uint8_t bool)
{
	setreg(&DMA1_Stream4->CR, 1, 2, bool);
}
void STM32FXXXDMA1_stream4_cr_dmeie(uint8_t bool)
{
	setreg(&DMA1_Stream4->CR, 1, 1, bool);
}
void STM32FXXXDMA1_stream4_cr_en(uint8_t bool)
{
	setreg(&DMA1_Stream4->CR, 1, 0, bool);
}
/*** Inic DMA1 STREAM4 CR ***/
STM32FXXXDMA_STREAM_cr* stm32fxxx_dma1_stream4_cr_inic(void)
{

	// CR
	stm32fxxx_dma1_stream4_cr.chsel = STM32FXXXDMA1_stream4_cr_chsel;
	stm32fxxx_dma1_stream4_cr.mburst = STM32FXXXDMA1_stream4_cr_mburst;
	stm32fxxx_dma1_stream4_cr.pburst = STM32FXXXDMA1_stream4_cr_pburst;
	stm32fxxx_dma1_stream4_cr.ct = STM32FXXXDMA1_stream4_cr_ct;
	stm32fxxx_dma1_stream4_cr.dbm = STM32FXXXDMA1_stream4_cr_dbm;
	stm32fxxx_dma1_stream4_cr.pl = STM32FXXXDMA1_stream4_cr_pl;
	stm32fxxx_dma1_stream4_cr.pincos = STM32FXXXDMA1_stream4_cr_pincos;
	stm32fxxx_dma1_stream4_cr.msize = STM32FXXXDMA1_stream4_cr_msize;
	stm32fxxx_dma1_stream4_cr.psize = STM32FXXXDMA1_stream4_cr_psize;
	stm32fxxx_dma1_stream4_cr.minc = STM32FXXXDMA1_stream4_cr_minc;
	stm32fxxx_dma1_stream4_cr.pinc = STM32FXXXDMA1_stream4_cr_pinc;
	stm32fxxx_dma1_stream4_cr.circ = STM32FXXXDMA1_stream4_cr_circ;
	stm32fxxx_dma1_stream4_cr.dir = STM32FXXXDMA1_stream4_cr_dir;
	stm32fxxx_dma1_stream4_cr.pfctrl = STM32FXXXDMA1_stream4_cr_pfctrl;
	stm32fxxx_dma1_stream4_cr.tcie = STM32FXXXDMA1_stream4_cr_tcie;
	stm32fxxx_dma1_stream4_cr.htie = STM32FXXXDMA1_stream4_cr_htie;
	stm32fxxx_dma1_stream4_cr.teie = STM32FXXXDMA1_stream4_cr_teie;
	stm32fxxx_dma1_stream4_cr.dmeie = STM32FXXXDMA1_stream4_cr_dmeie;
	stm32fxxx_dma1_stream4_cr.en = STM32FXXXDMA1_stream4_cr_en;
	return &stm32fxxx_dma1_stream4_cr;
}
/*** Inic DMA1 STREAM4 Function ***/
void stm32fxxx_dma1_stream4_ndt(uint16_t value)
{
	DMA1_Stream4->NDTR = value;
}
void stm32fxxx_dma1_stream4_par(volatile long unsigned int periferal_addr)
{
	DMA1_Stream4->PAR = periferal_addr;
}
void stm32fxxx_dma1_stream4_m0a(volatile long unsigned int mem0_addr)
{
	DMA1_Stream4->M0AR = mem0_addr;
}
void stm32fxxx_dma1_stream4_m1a(volatile long unsigned int mem1_addr)
{
	DMA1_Stream4->M1AR = mem1_addr;
}
// DMA1 STREAM5 CR
void STM32FXXXDMA1_stream5_cr_chsel(uint8_t value)
{
	setreg(&DMA1_Stream5->CR, 3, 25, value);
}
void STM32FXXXDMA1_stream5_cr_mburst(uint8_t value)
{
	setreg(&DMA1_Stream5->CR, 2, 23, value);
}
void STM32FXXXDMA1_stream5_cr_pburst(uint8_t value)
{
	setreg(&DMA1_Stream5->CR, 2, 21, value);
}
void STM32FXXXDMA1_stream5_cr_ct(uint8_t bool)
{
	setreg(&DMA1_Stream5->CR, 1, 19, bool);
}
void STM32FXXXDMA1_stream5_cr_dbm(uint8_t bool)
{
	setreg(&DMA1_Stream5->CR, 1, 18, bool);
}
void STM32FXXXDMA1_stream5_cr_pl(uint8_t value)
{
	setreg(&DMA1_Stream5->CR, 2, 16, value);
}
void STM32FXXXDMA1_stream5_cr_pincos(uint8_t bool)
{
	setreg(&DMA1_Stream5->CR, 1, 15, bool);
}
void STM32FXXXDMA1_stream5_cr_msize(uint8_t value)
{
	setreg(&DMA1_Stream5->CR, 2, 13, value);
}
void STM32FXXXDMA1_stream5_cr_psize(uint8_t value)
{
	setreg(&DMA1_Stream5->CR, 2, 11, value);
}
void STM32FXXXDMA1_stream5_cr_minc(uint8_t bool)
{
	setreg(&DMA1_Stream5->CR, 1, 10, bool);
}
void STM32FXXXDMA1_stream5_cr_pinc(uint8_t bool)
{
	setreg(&DMA1_Stream5->CR, 1, 9, bool);
}
void STM32FXXXDMA1_stream5_cr_circ(uint8_t bool)
{
	setreg(&DMA1_Stream5->CR, 1, 8, bool);
}
void STM32FXXXDMA1_stream5_cr_dir(uint8_t value)
{
	setreg(&DMA1_Stream5->CR, 2, 7, value);
}
void STM32FXXXDMA1_stream5_cr_pfctrl(uint8_t bool)
{
	setreg(&DMA1_Stream5->CR, 1, 5, bool);
}
void STM32FXXXDMA1_stream5_cr_tcie(uint8_t bool)
{
	setreg(&DMA1_Stream5->CR, 1, 4, bool);
}
void STM32FXXXDMA1_stream5_cr_htie(uint8_t bool)
{
	setreg(&DMA1_Stream5->CR, 1, 3, bool);
}
void STM32FXXXDMA1_stream5_cr_teie(uint8_t bool)
{
	setreg(&DMA1_Stream5->CR, 1, 2, bool);
}
void STM32FXXXDMA1_stream5_cr_dmeie(uint8_t bool)
{
	setreg(&DMA1_Stream5->CR, 1, 1, bool);
}
void STM32FXXXDMA1_stream5_cr_en(uint8_t bool)
{
	setreg(&DMA1_Stream5->CR, 1, 0, bool);
}
/*** Inic DMA1 STREAM5 CR ***/
STM32FXXXDMA_STREAM_cr* stm32fxxx_dma1_stream5_cr_inic(void)
{

	// CR
	stm32fxxx_dma1_stream5_cr.chsel = STM32FXXXDMA1_stream5_cr_chsel;
	stm32fxxx_dma1_stream5_cr.mburst = STM32FXXXDMA1_stream5_cr_mburst;
	stm32fxxx_dma1_stream5_cr.pburst = STM32FXXXDMA1_stream5_cr_pburst;
	stm32fxxx_dma1_stream5_cr.ct = STM32FXXXDMA1_stream5_cr_ct;
	stm32fxxx_dma1_stream5_cr.dbm = STM32FXXXDMA1_stream5_cr_dbm;
	stm32fxxx_dma1_stream5_cr.pl = STM32FXXXDMA1_stream5_cr_pl;
	stm32fxxx_dma1_stream5_cr.pincos = STM32FXXXDMA1_stream5_cr_pincos;
	stm32fxxx_dma1_stream5_cr.msize = STM32FXXXDMA1_stream5_cr_msize;
	stm32fxxx_dma1_stream5_cr.psize = STM32FXXXDMA1_stream5_cr_psize;
	stm32fxxx_dma1_stream5_cr.minc = STM32FXXXDMA1_stream5_cr_minc;
	stm32fxxx_dma1_stream5_cr.pinc = STM32FXXXDMA1_stream5_cr_pinc;
	stm32fxxx_dma1_stream5_cr.circ = STM32FXXXDMA1_stream5_cr_circ;
	stm32fxxx_dma1_stream5_cr.dir = STM32FXXXDMA1_stream5_cr_dir;
	stm32fxxx_dma1_stream5_cr.pfctrl = STM32FXXXDMA1_stream5_cr_pfctrl;
	stm32fxxx_dma1_stream5_cr.tcie = STM32FXXXDMA1_stream5_cr_tcie;
	stm32fxxx_dma1_stream5_cr.htie = STM32FXXXDMA1_stream5_cr_htie;
	stm32fxxx_dma1_stream5_cr.teie = STM32FXXXDMA1_stream5_cr_teie;
	stm32fxxx_dma1_stream5_cr.dmeie = STM32FXXXDMA1_stream5_cr_dmeie;
	stm32fxxx_dma1_stream5_cr.en = STM32FXXXDMA1_stream5_cr_en;
	return &stm32fxxx_dma1_stream5_cr;
}
/*** Inic DMA1 STREAM5 Function ***/
void stm32fxxx_dma1_stream5_ndt(uint16_t value)
{
	DMA1_Stream5->NDTR = value;
}
void stm32fxxx_dma1_stream5_par(volatile long unsigned int periferal_addr)
{
	DMA1_Stream5->PAR = periferal_addr;
}
void stm32fxxx_dma1_stream5_m0a(volatile long unsigned int mem0_addr)
{
	DMA1_Stream5->M0AR = mem0_addr;
}
void stm32fxxx_dma1_stream5_m1a(volatile long unsigned int mem1_addr)
{
	DMA1_Stream5->M1AR = mem1_addr;
}
// DMA1 STREAM6 CR
void STM32FXXXDMA1_stream6_cr_chsel(uint8_t value)
{
	setreg(&DMA1_Stream6->CR, 3, 25, value);
}
void STM32FXXXDMA1_stream6_cr_mburst(uint8_t value)
{
	setreg(&DMA1_Stream6->CR, 2, 23, value);
}
void STM32FXXXDMA1_stream6_cr_pburst(uint8_t value)
{
	setreg(&DMA1_Stream6->CR, 2, 21, value);
}
void STM32FXXXDMA1_stream6_cr_ct(uint8_t bool)
{
	setreg(&DMA1_Stream6->CR, 1, 19, bool);
}
void STM32FXXXDMA1_stream6_cr_dbm(uint8_t bool)
{
	setreg(&DMA1_Stream6->CR, 1, 18, bool);
}
void STM32FXXXDMA1_stream6_cr_pl(uint8_t value)
{
	setreg(&DMA1_Stream6->CR, 2, 16, value);
}
void STM32FXXXDMA1_stream6_cr_pincos(uint8_t bool)
{
	setreg(&DMA1_Stream6->CR, 1, 15, bool);
}
void STM32FXXXDMA1_stream6_cr_msize(uint8_t value)
{
	setreg(&DMA1_Stream6->CR, 2, 13, value);
}
void STM32FXXXDMA1_stream6_cr_psize(uint8_t value)
{
	setreg(&DMA1_Stream6->CR, 2, 11, value);
}
void STM32FXXXDMA1_stream6_cr_minc(uint8_t bool)
{
	setreg(&DMA1_Stream6->CR, 1, 10, bool);
}
void STM32FXXXDMA1_stream6_cr_pinc(uint8_t bool)
{
	setreg(&DMA1_Stream6->CR, 1, 9, bool);
}
void STM32FXXXDMA1_stream6_cr_circ(uint8_t bool)
{
	setreg(&DMA1_Stream6->CR, 1, 8, bool);
}
void STM32FXXXDMA1_stream6_cr_dir(uint8_t value)
{
	setreg(&DMA1_Stream6->CR, 2, 7, value);
}
void STM32FXXXDMA1_stream6_cr_pfctrl(uint8_t bool)
{
	setreg(&DMA1_Stream6->CR, 1, 5, bool);
}
void STM32FXXXDMA1_stream6_cr_tcie(uint8_t bool)
{
	setreg(&DMA1_Stream6->CR, 1, 4, bool);
}
void STM32FXXXDMA1_stream6_cr_htie(uint8_t bool)
{
	setreg(&DMA1_Stream6->CR, 1, 3, bool);
}
void STM32FXXXDMA1_stream6_cr_teie(uint8_t bool)
{
	setreg(&DMA1_Stream6->CR, 1, 2, bool);
}
void STM32FXXXDMA1_stream6_cr_dmeie(uint8_t bool)
{
	setreg(&DMA1_Stream6->CR, 1, 1, bool);
}
void STM32FXXXDMA1_stream6_cr_en(uint8_t bool)
{
	setreg(&DMA1_Stream6->CR, 1, 0, bool);
}
/*** Inic DMA1 STREAM6 CR ***/
STM32FXXXDMA_STREAM_cr* stm32fxxx_dma1_stream6_cr_inic(void)
{

	// CR
	stm32fxxx_dma1_stream6_cr.chsel = STM32FXXXDMA1_stream6_cr_chsel;
	stm32fxxx_dma1_stream6_cr.mburst = STM32FXXXDMA1_stream6_cr_mburst;
	stm32fxxx_dma1_stream6_cr.pburst = STM32FXXXDMA1_stream6_cr_pburst;
	stm32fxxx_dma1_stream6_cr.ct = STM32FXXXDMA1_stream6_cr_ct;
	stm32fxxx_dma1_stream6_cr.dbm = STM32FXXXDMA1_stream6_cr_dbm;
	stm32fxxx_dma1_stream6_cr.pl = STM32FXXXDMA1_stream6_cr_pl;
	stm32fxxx_dma1_stream6_cr.pincos = STM32FXXXDMA1_stream6_cr_pincos;
	stm32fxxx_dma1_stream6_cr.msize = STM32FXXXDMA1_stream6_cr_msize;
	stm32fxxx_dma1_stream6_cr.psize = STM32FXXXDMA1_stream6_cr_psize;
	stm32fxxx_dma1_stream6_cr.minc = STM32FXXXDMA1_stream6_cr_minc;
	stm32fxxx_dma1_stream6_cr.pinc = STM32FXXXDMA1_stream6_cr_pinc;
	stm32fxxx_dma1_stream6_cr.circ = STM32FXXXDMA1_stream6_cr_circ;
	stm32fxxx_dma1_stream6_cr.dir = STM32FXXXDMA1_stream6_cr_dir;
	stm32fxxx_dma1_stream6_cr.pfctrl = STM32FXXXDMA1_stream6_cr_pfctrl;
	stm32fxxx_dma1_stream6_cr.tcie = STM32FXXXDMA1_stream6_cr_tcie;
	stm32fxxx_dma1_stream6_cr.htie = STM32FXXXDMA1_stream6_cr_htie;
	stm32fxxx_dma1_stream6_cr.teie = STM32FXXXDMA1_stream6_cr_teie;
	stm32fxxx_dma1_stream6_cr.dmeie = STM32FXXXDMA1_stream6_cr_dmeie;
	stm32fxxx_dma1_stream6_cr.en = STM32FXXXDMA1_stream6_cr_en;
	return &stm32fxxx_dma1_stream6_cr;
}
/*** Inic DMA1 STREAM6 Function ***/
void stm32fxxx_dma1_stream6_ndt(uint16_t value)
{
	DMA1_Stream6->NDTR = value;
}
void stm32fxxx_dma1_stream6_par(volatile long unsigned int periferal_addr)
{
	DMA1_Stream6->PAR = periferal_addr;
}
void stm32fxxx_dma1_stream6_m0a(volatile long unsigned int mem0_addr)
{
	DMA1_Stream6->M0AR = mem0_addr;
}
void stm32fxxx_dma1_stream6_m1a(volatile long unsigned int mem1_addr)
{
	DMA1_Stream6->M1AR = mem1_addr;
}
// DMA1 STREAM7 CR
void STM32FXXXDMA1_stream7_cr_chsel(uint8_t value)
{
	setreg(&DMA1_Stream7->CR, 3, 25, value);
}
void STM32FXXXDMA1_stream7_cr_mburst(uint8_t value)
{
	setreg(&DMA1_Stream7->CR, 2, 23, value);
}
void STM32FXXXDMA1_stream7_cr_pburst(uint8_t value)
{
	setreg(&DMA1_Stream7->CR, 2, 21, value);
}
void STM32FXXXDMA1_stream7_cr_ct(uint8_t bool)
{
	setreg(&DMA1_Stream7->CR, 1, 19, bool);
}
void STM32FXXXDMA1_stream7_cr_dbm(uint8_t bool)
{
	setreg(&DMA1_Stream7->CR, 1, 18, bool);
}
void STM32FXXXDMA1_stream7_cr_pl(uint8_t value)
{
	setreg(&DMA1_Stream7->CR, 2, 16, value);
}
void STM32FXXXDMA1_stream7_cr_pincos(uint8_t bool)
{
	setreg(&DMA1_Stream7->CR, 1, 15, bool);
}
void STM32FXXXDMA1_stream7_cr_msize(uint8_t value)
{
	setreg(&DMA1_Stream7->CR, 2, 13, value);
}
void STM32FXXXDMA1_stream7_cr_psize(uint8_t value)
{
	setreg(&DMA1_Stream7->CR, 2, 11, value);
}
void STM32FXXXDMA1_stream7_cr_minc(uint8_t bool)
{
	setreg(&DMA1_Stream7->CR, 1, 10, bool);
}
void STM32FXXXDMA1_stream7_cr_pinc(uint8_t bool)
{
	setreg(&DMA1_Stream7->CR, 1, 9, bool);
}
void STM32FXXXDMA1_stream7_cr_circ(uint8_t bool)
{
	setreg(&DMA1_Stream7->CR, 1, 8, bool);
}
void STM32FXXXDMA1_stream7_cr_dir(uint8_t value)
{
	setreg(&DMA1_Stream7->CR, 2, 7, value);
}
void STM32FXXXDMA1_stream7_cr_pfctrl(uint8_t bool)
{
	setreg(&DMA1_Stream7->CR, 1, 5, bool);
}
void STM32FXXXDMA1_stream7_cr_tcie(uint8_t bool)
{
	setreg(&DMA1_Stream7->CR, 1, 4, bool);
}
void STM32FXXXDMA1_stream7_cr_htie(uint8_t bool)
{
	setreg(&DMA1_Stream7->CR, 1, 3, bool);
}
void STM32FXXXDMA1_stream7_cr_teie(uint8_t bool)
{
	setreg(&DMA1_Stream7->CR, 1, 2, bool);
}
void STM32FXXXDMA1_stream7_cr_dmeie(uint8_t bool)
{
	setreg(&DMA1_Stream7->CR, 1, 1, bool);
}
void STM32FXXXDMA1_stream7_cr_en(uint8_t bool)
{
	setreg(&DMA1_Stream7->CR, 1, 0, bool);
}
/*** Inic DMA1 STREAM7 CR ***/
STM32FXXXDMA_STREAM_cr* stm32fxxx_dma1_stream7_cr_inic(void)
{

