BitNibble/Source_Library/stm32fxxxlib/Library/Src/stm32fxxxdma.c
	// CR
	stm32fxxx_dma1_stream7_cr.chsel = STM32FXXXDMA1_stream7_cr_chsel;
	stm32fxxx_dma1_stream7_cr.mburst = STM32FXXXDMA1_stream7_cr_mburst;
	stm32fxxx_dma1_stream7_cr.pburst = STM32FXXXDMA1_stream7_cr_pburst;
	stm32fxxx_dma1_stream7_cr.ct = STM32FXXXDMA1_stream7_cr_ct;
	stm32fxxx_dma1_stream7_cr.dbm = STM32FXXXDMA1_stream7_cr_dbm;
	stm32fxxx_dma1_stream7_cr.pl = STM32FXXXDMA1_stream7_cr_pl;
	stm32fxxx_dma1_stream7_cr.pincos = STM32FXXXDMA1_stream7_cr_pincos;
	stm32fxxx_dma1_stream7_cr.msize = STM32FXXXDMA1_stream7_cr_msize;
	stm32fxxx_dma1_stream7_cr.psize = STM32FXXXDMA1_stream7_cr_psize;
	stm32fxxx_dma1_stream7_cr.minc = STM32FXXXDMA1_stream7_cr_minc;
	stm32fxxx_dma1_stream7_cr.pinc = STM32FXXXDMA1_stream7_cr_pinc;
	stm32fxxx_dma1_stream7_cr.circ = STM32FXXXDMA1_stream7_cr_circ;
	stm32fxxx_dma1_stream7_cr.dir = STM32FXXXDMA1_stream7_cr_dir;
	stm32fxxx_dma1_stream7_cr.pfctrl = STM32FXXXDMA1_stream7_cr_pfctrl;
	stm32fxxx_dma1_stream7_cr.tcie = STM32FXXXDMA1_stream7_cr_tcie;
	stm32fxxx_dma1_stream7_cr.htie = STM32FXXXDMA1_stream7_cr_htie;
	stm32fxxx_dma1_stream7_cr.teie = STM32FXXXDMA1_stream7_cr_teie;
	stm32fxxx_dma1_stream7_cr.dmeie = STM32FXXXDMA1_stream7_cr_dmeie;
	stm32fxxx_dma1_stream7_cr.en = STM32FXXXDMA1_stream7_cr_en;
	return &stm32fxxx_dma1_stream7_cr;
}
/*** Inic DMA1 STREAM7 Function ***/
void stm32fxxx_dma1_stream7_ndt(uint16_t value)
{
	DMA1_Stream7->NDTR = value;
}
void stm32fxxx_dma1_stream7_par(volatile long unsigned int periferal_addr)
{
	DMA1_Stream7->PAR = periferal_addr;
}
void stm32fxxx_dma1_stream7_m0a(volatile long unsigned int mem0_addr)
{
	DMA1_Stream7->M0AR = mem0_addr;
}
void stm32fxxx_dma1_stream7_m1a(volatile long unsigned int mem1_addr)
{
	DMA1_Stream7->M1AR = mem1_addr;
}
// DMA1 STREAM0 FCR
void STM32FXXXDMA1_stream0_fcr_feie(uint8_t bool)
{
	setreg(&DMA1_Stream0->FCR, 1, 7, bool);
}
void STM32FXXXDMA1_stream0_fcr_fs(uint8_t value)
{
	setreg(&DMA1_Stream0->FCR, 3, 3, value);
}
void STM32FXXXDMA1_stream0_fcr_dmdis(uint8_t bool)
{
	setreg(&DMA1_Stream0->FCR, 1, 2, bool);
}
void STM32FXXXDMA1_stream0_fcr_fth(uint8_t value)
{
	setreg(&DMA1_Stream0->FCR, 2, 0, value);
}
/*** Inic DMA1 STREAM0 FCR ***/
STM32FXXXDMA_STREAM_fcr* stm32fxxx_dma1_stream0_fcr_inic(void)
{

	// FCR
	stm32fxxx_dma1_stream0_fcr.feie = STM32FXXXDMA1_stream0_fcr_feie;
	stm32fxxx_dma1_stream0_fcr.fs = STM32FXXXDMA1_stream0_fcr_fs;
	stm32fxxx_dma1_stream0_fcr.dmdis = STM32FXXXDMA1_stream0_fcr_dmdis;
	stm32fxxx_dma1_stream0_fcr.fth = STM32FXXXDMA1_stream0_fcr_fth;
	return &stm32fxxx_dma1_stream0_fcr;
}
// DMA1 STREAM1 FCR
void STM32FXXXDMA1_stream1_fcr_feie(uint8_t bool)
{
	setreg(&DMA1_Stream1->FCR, 1, 7, bool);
}
void STM32FXXXDMA1_stream1_fcr_fs(uint8_t value)
{
	setreg(&DMA1_Stream1->FCR, 3, 3, value);
}
void STM32FXXXDMA1_stream1_fcr_dmdis(uint8_t bool)
{
	setreg(&DMA1_Stream1->FCR, 1, 2, bool);
}
void STM32FXXXDMA1_stream1_fcr_fth(uint8_t value)
{
	setreg(&DMA1_Stream1->FCR, 2, 0, value);
}
/*** Inic DMA1 STREAM1 FCR ***/
STM32FXXXDMA_STREAM_fcr* stm32fxxx_dma1_stream1_fcr_inic(void)
{

	// FCR
	stm32fxxx_dma1_stream1_fcr.feie = STM32FXXXDMA1_stream1_fcr_feie;
	stm32fxxx_dma1_stream1_fcr.fs = STM32FXXXDMA1_stream1_fcr_fs;
	stm32fxxx_dma1_stream1_fcr.dmdis = STM32FXXXDMA1_stream1_fcr_dmdis;
	stm32fxxx_dma1_stream1_fcr.fth = STM32FXXXDMA1_stream1_fcr_fth;
	return &stm32fxxx_dma1_stream1_fcr;
}
// DMA1 STREAM2 FCR
void STM32FXXXDMA1_stream2_fcr_feie(uint8_t bool)
{
	setreg(&DMA1_Stream2->FCR, 1, 7, bool);
}
void STM32FXXXDMA1_stream2_fcr_fs(uint8_t value)
{
	setreg(&DMA1_Stream2->FCR, 3, 3, value);
}
void STM32FXXXDMA1_stream2_fcr_dmdis(uint8_t bool)
{
	setreg(&DMA1_Stream2->FCR, 1, 2, bool);
}
void STM32FXXXDMA1_stream2_fcr_fth(uint8_t value)
{
	setreg(&DMA1_Stream2->FCR, 2, 0, value);
}
/*** Inic DMA1 STREAM2 FCR ***/
STM32FXXXDMA_STREAM_fcr* stm32fxxx_dma1_stream2_fcr_inic(void)
{

	// FCR
	stm32fxxx_dma1_stream2_fcr.feie = STM32FXXXDMA1_stream2_fcr_feie;
	stm32fxxx_dma1_stream2_fcr.fs = STM32FXXXDMA1_stream2_fcr_fs;
	stm32fxxx_dma1_stream2_fcr.dmdis = STM32FXXXDMA1_stream2_fcr_dmdis;
	stm32fxxx_dma1_stream2_fcr.fth = STM32FXXXDMA1_stream2_fcr_fth;
	return &stm32fxxx_dma1_stream2_fcr;
}
// DMA1 STREAM3 FCR
void STM32FXXXDMA1_stream3_fcr_feie(uint8_t bool)
{
	setreg(&DMA1_Stream3->FCR, 1, 7, bool);
}
void STM32FXXXDMA1_stream3_fcr_fs(uint8_t value)
{
	setreg(&DMA1_Stream3->FCR, 3, 3, value);
}
void STM32FXXXDMA1_stream3_fcr_dmdis(uint8_t bool)
{
	setreg(&DMA1_Stream3->FCR, 1, 2, bool);
}
void STM32FXXXDMA1_stream3_fcr_fth(uint8_t value)
{
	setreg(&DMA1_Stream3->FCR, 2, 0, value);
}
/*** Inic DMA1 STREAM3 FCR ***/
STM32FXXXDMA_STREAM_fcr* stm32fxxx_dma1_stream3_fcr_inic(void)
{

	// FCR
	stm32fxxx_dma1_stream3_fcr.feie = STM32FXXXDMA1_stream3_fcr_feie;
	stm32fxxx_dma1_stream3_fcr.fs = STM32FXXXDMA1_stream3_fcr_fs;
	stm32fxxx_dma1_stream3_fcr.dmdis = STM32FXXXDMA1_stream3_fcr_dmdis;
	stm32fxxx_dma1_stream3_fcr.fth = STM32FXXXDMA1_stream3_fcr_fth;
	return &stm32fxxx_dma1_stream3_fcr;
}
// DMA1 STREAM4 FCR
void STM32FXXXDMA1_stream4_fcr_feie(uint8_t bool)
{
	setreg(&DMA1_Stream4->FCR, 1, 7, bool);
}
void STM32FXXXDMA1_stream4_fcr_fs(uint8_t value)
{
	setreg(&DMA1_Stream4->FCR, 3, 3, value);
}
void STM32FXXXDMA1_stream4_fcr_dmdis(uint8_t bool)
{
	setreg(&DMA1_Stream4->FCR, 1, 2, bool);
}
void STM32FXXXDMA1_stream4_fcr_fth(uint8_t value)
{
	setreg(&DMA1_Stream4->FCR, 2, 0, value);
}
/*** Inic DMA1 STREAM4 FCR ***/
STM32FXXXDMA_STREAM_fcr* stm32fxxx_dma1_stream4_fcr_inic(void)
{

	// FCR
	stm32fxxx_dma1_stream4_fcr.feie = STM32FXXXDMA1_stream4_fcr_feie;
	stm32fxxx_dma1_stream4_fcr.fs = STM32FXXXDMA1_stream4_fcr_fs;
	stm32fxxx_dma1_stream4_fcr.dmdis = STM32FXXXDMA1_stream4_fcr_dmdis;
	stm32fxxx_dma1_stream4_fcr.fth = STM32FXXXDMA1_stream4_fcr_fth;
	return &stm32fxxx_dma1_stream4_fcr;
}
// DMA1 STREAM5 FCR
void STM32FXXXDMA1_stream5_fcr_feie(uint8_t bool)
{
	setreg(&DMA1_Stream5->FCR, 1, 7, bool);
}
void STM32FXXXDMA1_stream5_fcr_fs(uint8_t value)
{
	setreg(&DMA1_Stream5->FCR, 3, 3, value);
}
void STM32FXXXDMA1_stream5_fcr_dmdis(uint8_t bool)
{
	setreg(&DMA1_Stream5->FCR, 1, 2, bool);
}
void STM32FXXXDMA1_stream5_fcr_fth(uint8_t value)
{
	setreg(&DMA1_Stream5->FCR, 2, 0, value);
}
/*** Inic DMA1 STREAM5 FCR ***/
STM32FXXXDMA_STREAM_fcr* stm32fxxx_dma1_stream5_fcr_inic(void)
{

	// FCR
	stm32fxxx_dma1_stream5_fcr.feie = STM32FXXXDMA1_stream5_fcr_feie;
	stm32fxxx_dma1_stream5_fcr.fs = STM32FXXXDMA1_stream5_fcr_fs;
	stm32fxxx_dma1_stream5_fcr.dmdis = STM32FXXXDMA1_stream5_fcr_dmdis;
	stm32fxxx_dma1_stream5_fcr.fth = STM32FXXXDMA1_stream5_fcr_fth;
	return &stm32fxxx_dma1_stream5_fcr;
}
// DMA1 STREAM6 FCR
void STM32FXXXDMA1_stream6_fcr_feie(uint8_t bool)
{
	setreg(&DMA1_Stream6->FCR, 1, 7, bool);
}
void STM32FXXXDMA1_stream6_fcr_fs(uint8_t value)
{
	setreg(&DMA1_Stream6->FCR, 3, 3, value);
}
void STM32FXXXDMA1_stream6_fcr_dmdis(uint8_t bool)
{
	setreg(&DMA1_Stream6->FCR, 1, 2, bool);
}
void STM32FXXXDMA1_stream6_fcr_fth(uint8_t value)
{
	setreg(&DMA1_Stream6->FCR, 2, 0, value);
}
/*** Inic DMA1 STREAM6 FCR ***/
STM32FXXXDMA_STREAM_fcr* stm32fxxx_dma1_stream6_fcr_inic(void)
{

	// FCR
	stm32fxxx_dma1_stream6_fcr.feie = STM32FXXXDMA1_stream6_fcr_feie;
	stm32fxxx_dma1_stream6_fcr.fs = STM32FXXXDMA1_stream6_fcr_fs;
	stm32fxxx_dma1_stream6_fcr.dmdis = STM32FXXXDMA1_stream6_fcr_dmdis;
	stm32fxxx_dma1_stream6_fcr.fth = STM32FXXXDMA1_stream6_fcr_fth;
	return &stm32fxxx_dma1_stream6_fcr;
}
// DMA1 STREAM0 FCR
void STM32FXXXDMA1_stream7_fcr_feie(uint8_t bool)
{
	setreg(&DMA1_Stream7->FCR, 1, 7, bool);
}
void STM32FXXXDMA1_stream7_fcr_fs(uint8_t value)
{
	setreg(&DMA1_Stream7->FCR, 3, 3, value);
}
void STM32FXXXDMA1_stream7_fcr_dmdis(uint8_t bool)
{
	setreg(&DMA1_Stream7->FCR, 1, 2, bool);
}
void STM32FXXXDMA1_stream7_fcr_fth(uint8_t value)
{
	setreg(&DMA1_Stream7->FCR, 2, 0, value);
}
/*** Inic DMA1 STREAM7 FCR ***/
STM32FXXXDMA_STREAM_fcr* stm32fxxx_dma1_stream7_fcr_inic(void)
{

	// FCR
	stm32fxxx_dma1_stream7_fcr.feie = STM32FXXXDMA1_stream7_fcr_feie;
	stm32fxxx_dma1_stream7_fcr.fs = STM32FXXXDMA1_stream7_fcr_fs;
	stm32fxxx_dma1_stream7_fcr.dmdis = STM32FXXXDMA1_stream7_fcr_dmdis;
	stm32fxxx_dma1_stream7_fcr.fth = STM32FXXXDMA1_stream7_fcr_fth;
	return &stm32fxxx_dma1_stream7_fcr;
}
/*** FUNC ***/
void dma1_circ_cfg(volatile long unsigned int* p_addr, volatile long unsigned int* m_addr, uint8_t stream_n, uint8_t channel_n, uint16_t quant_d, uint8_t p_size, uint8_t m_size, uint8_t priority, uint8_t dir)
{
	setreg(&RCC->AHB1ENR, 1, 22, 1);
	// Filter to Default
	if(stream_n > 7){ stream_n = 0;}
	if(channel_n > 7){ channel_n = 0;}
	if(quant_d > 65535){ quant_d = 1;}
	if(p_size > 2){ p_size = 0;}
	if(m_size > 2){ m_size = 0;}
	if(priority > 3){ priority = 0;}
	if( p_addr && m_addr ){
		/*** Verify Ready for Parameter ***/
		setreg(&(DMA1_Stream0 + stream_n)->CR, 1, 0, 0);
		for(time_out = 200; readreg((DMA1_Stream0 + stream_n)->CR, 1, 0) && time_out; time_out--);
		/*** Parameter Configure ***/
		(DMA1_Stream0 + stream_n)->PAR = (volatile long unsigned int) p_addr;
		(DMA1_Stream0 + stream_n)->M0AR = (volatile long unsigned int) m_addr;
		setreg(&(DMA1_Stream0 + stream_n)->CR, 1, 5, 0); // 0 -> dma, 1 -> peri
		setreg(&(DMA1_Stream0 + stream_n)->CR, 3, 25, channel_n); // channel
		(DMA1_Stream0 + stream_n)->NDTR = quant_d; //
		setreg(&(DMA1_Stream0 + stream_n)->CR, 2, 13, m_size); // msize 2 -> 32bit
		setreg(&(DMA1_Stream0 + stream_n)->CR, 2, 11, p_size); // psize 1 -> 16bit
		setreg(&(DMA1_Stream0 + stream_n)->CR, 2, 16, priority); // priority
		if(dir){
			setreg(&(DMA1_Stream0 + stream_n)->CR, 2, 6, 1); // DIR
			setreg(&(DMA1_Stream0 + stream_n)->CR, 1, 9, 1); // PINC
			setreg(&(DMA1_Stream0 + stream_n)->CR, 1, 10, 0); // MINC
		}else{
			setreg(&(DMA1_Stream0 + stream_n)->CR, 2, 6, 0); // DIR
			setreg(&(DMA1_Stream0 + stream_n)->CR, 1, 9, 0); // PINC
			setreg(&(DMA1_Stream0 + stream_n)->CR, 1, 10, 1); // MINC
		}
		setreg(&(DMA1_Stream0 + stream_n)->CR, 1, 8, 1); // CIRC
		setreg(&(DMA1_Stream0 + stream_n)->CR, 1, 0, 1); // ENABLE
	}
}
/*** Inic FUNC ***/
STM32FXXXDMA_func* stm32fxxx_dma1_func_inic(void)
{

	stm32fxxx_dma1_func.circ_cfg = dma1_circ_cfg;
	return &stm32fxxx_dma1_func;
}
/****************************************************/
/**** DMA1 INIC Procedure & Function Definition *****/
/****************************************************/
STM32FXXXDMA1obj dma1_enable(void)
{

	/*** DMA1 Bit Mapping Link ***/
	stm32fxxx_dma1.sr = stm32fxxx_dma1_sr_inic();

	stm32fxxx_dma1.stream[0]->cr = stm32fxxx_dma1_stream0_cr_inic();
	stm32fxxx_dma1.stream[0]->fcr = stm32fxxx_dma1_stream0_fcr_inic();
	stm32fxxx_dma1.stream[0]->ndt = stm32fxxx_dma1_stream0_ndt;
	stm32fxxx_dma1.stream[0]->par = stm32fxxx_dma1_stream0_par;
	stm32fxxx_dma1.stream[0]->m0a = stm32fxxx_dma1_stream0_m0a;
	stm32fxxx_dma1.stream[0]->m1a = stm32fxxx_dma1_stream0_m1a;

	stm32fxxx_dma1.stream[1]->cr = stm32fxxx_dma1_stream1_cr_inic();
	stm32fxxx_dma1.stream[1]->fcr = stm32fxxx_dma1_stream1_fcr_inic();
	stm32fxxx_dma1.stream[1]->ndt = stm32fxxx_dma1_stream1_ndt;
	stm32fxxx_dma1.stream[1]->par = stm32fxxx_dma1_stream1_par;
	stm32fxxx_dma1.stream[1]->m0a = stm32fxxx_dma1_stream1_m0a;
	stm32fxxx_dma1.stream[1]->m1a = stm32fxxx_dma1_stream1_m1a;

	stm32fxxx_dma1.stream[2]->cr = stm32fxxx_dma1_stream2_cr_inic();
	stm32fxxx_dma1.stream[2]->fcr = stm32fxxx_dma1_stream2_fcr_inic();
	stm32fxxx_dma1.stream[2]->ndt = stm32fxxx_dma1_stream2_ndt;
	stm32fxxx_dma1.stream[2]->par = stm32fxxx_dma1_stream2_par;
	stm32fxxx_dma1.stream[2]->m0a = stm32fxxx_dma1_stream2_m0a;
	stm32fxxx_dma1.stream[2]->m1a = stm32fxxx_dma1_stream2_m1a;

