BitNibble/Source_Library/stm32fxxxlib/Library/Src/stm32fxxxdma.c
	stm32fxxx_dma1.stream[3]->cr = stm32fxxx_dma1_stream3_cr_inic();
	stm32fxxx_dma1.stream[3]->fcr = stm32fxxx_dma1_stream3_fcr_inic();
	stm32fxxx_dma1.stream[3]->ndt = stm32fxxx_dma1_stream3_ndt;
	stm32fxxx_dma1.stream[3]->par = stm32fxxx_dma1_stream3_par;
	stm32fxxx_dma1.stream[3]->m0a = stm32fxxx_dma1_stream3_m0a;
	stm32fxxx_dma1.stream[3]->m1a = stm32fxxx_dma1_stream3_m1a;

	stm32fxxx_dma1.stream[4]->cr = stm32fxxx_dma1_stream4_cr_inic();
	stm32fxxx_dma1.stream[4]->fcr = stm32fxxx_dma1_stream4_fcr_inic();
	stm32fxxx_dma1.stream[4]->ndt = stm32fxxx_dma1_stream4_ndt;
	stm32fxxx_dma1.stream[4]->par = stm32fxxx_dma1_stream4_par;
	stm32fxxx_dma1.stream[4]->m0a = stm32fxxx_dma1_stream4_m0a;
	stm32fxxx_dma1.stream[4]->m1a = stm32fxxx_dma1_stream4_m1a;

	stm32fxxx_dma1.stream[5]->cr = stm32fxxx_dma1_stream5_cr_inic();
	stm32fxxx_dma1.stream[5]->fcr = stm32fxxx_dma1_stream5_fcr_inic();
	stm32fxxx_dma1.stream[5]->ndt = stm32fxxx_dma1_stream5_ndt;
	stm32fxxx_dma1.stream[5]->par = stm32fxxx_dma1_stream5_par;
	stm32fxxx_dma1.stream[5]->m0a = stm32fxxx_dma1_stream5_m0a;
	stm32fxxx_dma1.stream[5]->m1a = stm32fxxx_dma1_stream5_m1a;

	stm32fxxx_dma1.stream[6]->cr = stm32fxxx_dma1_stream6_cr_inic();
	stm32fxxx_dma1.stream[6]->fcr = stm32fxxx_dma1_stream6_fcr_inic();
	stm32fxxx_dma1.stream[6]->ndt = stm32fxxx_dma1_stream6_ndt;
	stm32fxxx_dma1.stream[6]->par = stm32fxxx_dma1_stream6_par;
	stm32fxxx_dma1.stream[6]->m0a = stm32fxxx_dma1_stream6_m0a;
	stm32fxxx_dma1.stream[6]->m1a = stm32fxxx_dma1_stream6_m1a;

	stm32fxxx_dma1.stream[7]->cr = stm32fxxx_dma1_stream7_cr_inic();
	stm32fxxx_dma1.stream[7]->fcr = stm32fxxx_dma1_stream7_fcr_inic();
	stm32fxxx_dma1.stream[7]->ndt = stm32fxxx_dma1_stream7_ndt;
	stm32fxxx_dma1.stream[7]->par = stm32fxxx_dma1_stream7_par;
	stm32fxxx_dma1.stream[7]->m0a = stm32fxxx_dma1_stream7_m0a;
	stm32fxxx_dma1.stream[7]->m1a = stm32fxxx_dma1_stream7_m1a;
	/*** Other ***/
	stm32fxxx_dma1.func = stm32fxxx_dma1_func_inic();
	stm32fxxx_dma1.clock = STM32FXXXDma1Clock;
	return stm32fxxx_dma1;
}

STM32FXXXDMA1obj* dma1(void){ return &stm32fxxx_dma1; }

/********************************************/
/************* DMA2 Bit Mapping *************/
/********************************************/
// SR
uint8_t STM32FXXXDMA2_sr_tcif(uint8_t stream_n)
{
	uint8_t value = 0;
	switch(stream_n){
		case 0:
			value = readreg(DMA2->LISR, 1, 5);
		break;
		case 1:
			value = readreg(DMA2->LISR, 1, 11);
		break;
		case 2:
			value = readreg(DMA2->LISR, 1, 21);
		break;
		case 3:
			value = readreg(DMA2->LISR, 1, 27);
		break;
		case 4:
			value = readreg(DMA2->HISR, 1, 5);
		break;
		case 5:
			value = readreg(DMA2->HISR, 1, 11);
		break;
		case 6:
			value = readreg(DMA2->HISR, 1, 21);
		break;
		case 7:
			value = readreg(DMA2->HISR, 1, 27);
		break;
	default: break;
	}
	return value;
}
void STM32FXXXDMA2_sr_clear_tcif(uint8_t stream_n)
{
	switch(stream_n){
		case 0:
			setreg(&DMA2->LIFCR, 1, 5, 1);
		break;
		case 1:
			setreg(&DMA2->LIFCR, 1, 11, 1);
		break;
		case 2:
			setreg(&DMA2->LIFCR, 1, 21, 1);
		break;
		case 3:
			setreg(&DMA2->LIFCR, 1, 27, 1);
		break;
		case 4:
			setreg(&DMA2->HIFCR, 1, 5, 1);
		break;
		case 5:
			setreg(&DMA2->HIFCR, 1, 11, 1);
		break;
		case 6:
			setreg(&DMA2->HIFCR, 1, 21, 1);
		break;
		case 7:
			setreg(&DMA2->HIFCR, 1, 27, 1);
		break;
		default: break;
	}
}
uint8_t STM32FXXXDMA2_sr_htif(uint8_t stream_n)
{
	uint8_t value = 0;
	switch(stream_n){
		case 0:
			value = readreg(DMA2->LISR, 1, 4);
		break;
		case 1:
			value = readreg(DMA2->LISR, 1, 10);
		break;
		case 2:
			value = readreg(DMA2->LISR, 1, 20);
		break;
		case 3:
			value = readreg(DMA2->LISR, 1, 26);
		break;
		case 4:
			value = readreg(DMA2->HISR, 1, 4);
		break;
		case 5:
			value = readreg(DMA2->HISR, 1, 10);
		break;
		case 6:
			value = readreg(DMA2->HISR, 1, 20);
		break;
		case 7:
			value = readreg(DMA2->HISR, 1, 26);
		break;
	default: break;
	}
	return value;
}
void STM32FXXXDMA2_sr_clear_htif(uint8_t stream_n)
{
	switch(stream_n){
		case 0:
			setreg(&DMA2->LIFCR, 1, 4, 1);
		break;
		case 1:
			setreg(&DMA2->LIFCR, 1, 10, 1);
		break;
		case 2:
			setreg(&DMA2->LIFCR, 1, 20, 1);
		break;
		case 3:
			setreg(&DMA2->LIFCR, 1, 26, 1);
		break;
		case 4:
			setreg(&DMA2->HIFCR, 1, 4, 1);
		break;
		case 5:
			setreg(&DMA2->HIFCR, 1, 10, 1);
		break;
		case 6:
			setreg(&DMA2->HIFCR, 1, 20, 1);
		break;
		case 7:
			setreg(&DMA2->HIFCR, 1, 26, 1);
		break;
		default: break;
	}
}
uint8_t STM32FXXXDMA2_sr_teif(uint8_t stream_n)
{
	uint8_t value = 0;
	switch(stream_n){
		case 0:
			value = readreg(DMA2->LISR, 1, 3);
		break;
		case 1:
			value = readreg(DMA2->LISR, 1, 9);
		break;
		case 2:
			value = readreg(DMA2->LISR, 1, 19);
		break;
		case 3:
			value = readreg(DMA2->LISR, 1, 25);
		break;
		case 4:
			value = readreg(DMA2->HISR, 1, 3);
		break;
		case 5:
			value = readreg(DMA2->HISR, 1, 9);
		break;
		case 6:
			value = readreg(DMA2->HISR, 1, 19);
		break;
		case 7:
			value = readreg(DMA2->HISR, 1, 25);
		break;
	default: break;
	}
	return value;
}
void STM32FXXXDMA2_sr_clear_teif(uint8_t stream_n)
{
	switch(stream_n){
		case 0:
			setreg(&DMA2->LIFCR, 1, 3, 1);
		break;
		case 1:
			setreg(&DMA2->LIFCR, 1, 9, 1);
		break;
		case 2:
			setreg(&DMA2->LIFCR, 1, 19, 1);
		break;
		case 3:
			setreg(&DMA2->LIFCR, 1, 25, 1);
		break;
		case 4:
			setreg(&DMA2->HIFCR, 1, 3, 1);
		break;
		case 5:
			setreg(&DMA2->HIFCR, 1, 9, 1);
		break;
		case 6:
			setreg(&DMA2->HIFCR, 1, 19, 1);
		break;
		case 7:
			setreg(&DMA2->HIFCR, 1, 25, 1);
		break;
		default: break;
	}
}
uint8_t STM32FXXXDMA2_sr_dmeif(uint8_t stream_n)
{
	uint8_t value = 0;
	switch(stream_n){
		case 0:
			value = readreg(DMA2->LISR, 1, 2);
		break;
		case 1:
			value = readreg(DMA2->LISR, 1, 8);
		break;
		case 2:
			value = readreg(DMA2->LISR, 1, 18);
		break;
		case 3:
			value = readreg(DMA2->LISR, 1, 24);
		break;
		case 4:
			value = readreg(DMA2->HISR, 1, 2);
		break;
		case 5:
			value = readreg(DMA2->HISR, 1, 8);
		break;
		case 6:
			value = readreg(DMA2->HISR, 1, 18);
		break;
		case 7:
			value = readreg(DMA2->HISR, 1, 24);
		break;
	default: break;
	}
	return value;
}
void STM32FXXXDMA2_sr_clear_dmeif(uint8_t stream_n)
{
	switch(stream_n){
		case 0:
			setreg(&DMA2->LIFCR, 1, 2, 1);
		break;
		case 1:
			setreg(&DMA2->LIFCR, 1, 8, 1);
		break;
		case 2:
			setreg(&DMA2->LIFCR, 1, 18, 1);
		break;
		case 3:
			setreg(&DMA2->LIFCR, 1, 24, 1);
		break;
		case 4:
			setreg(&DMA2->HIFCR, 1, 2, 1);
		break;
		case 5:
			setreg(&DMA2->HIFCR, 1, 8, 1);
		break;
		case 6:
			setreg(&DMA2->HIFCR, 1, 18, 1);
		break;
		case 7:
			setreg(&DMA2->HIFCR, 1, 24, 1);
		break;
		default: break;
	}
}
uint8_t STM32FXXXDMA2_sr_feif(uint8_t stream_n)
{
	uint8_t value = 0;
	switch(stream_n){
		case 0:
			value = readreg(DMA2->LISR, 1, 0);
		break;
		case 1:
			value = readreg(DMA2->LISR, 1, 6);
		break;
		case 2:
			value = readreg(DMA2->LISR, 1, 16);
		break;
		case 3:
			value = readreg(DMA2->LISR, 1, 22);
		break;
		case 4:
			value = readreg(DMA2->HISR, 1, 0);
		break;
		case 5:
			value = readreg(DMA2->HISR, 1, 6);
		break;
		case 6:
			value = readreg(DMA2->HISR, 1, 16);
		break;
		case 7:
			value = readreg(DMA2->HISR, 1, 22);
		break;
	default: break;
	}
	return value;
}
void STM32FXXXDMA2_sr_clear_feif(uint8_t stream_n)
{
	switch(stream_n){
		case 0:
			setreg(&DMA2->LIFCR, 1, 0, 1);
		break;
		case 1:
			setreg(&DMA2->LIFCR, 1, 6, 1);
		break;
		case 2:
			setreg(&DMA2->LIFCR, 1, 16, 1);
		break;
		case 3:
			setreg(&DMA2->LIFCR, 1, 22, 1);
		break;
		case 4:
			setreg(&DMA2->HIFCR, 1, 0, 1);
		break;
		case 5:
			setreg(&DMA2->HIFCR, 1, 6, 1);
		break;
		case 6:
			setreg(&DMA2->HIFCR, 1, 16, 1);
		break;
		case 7:
			setreg(&DMA2->HIFCR, 1, 22, 1);
		break;
		default: break;
	}
}
/*** Inic SR ***/
STM32FXXXDMA_sr* stm32fxxx_dma2_sr_inic(void)
{

	// SR
	stm32fxxx_dma2_sr.tcif = STM32FXXXDMA2_sr_tcif;
	stm32fxxx_dma2_sr.clear_tcif = STM32FXXXDMA2_sr_clear_tcif;
	stm32fxxx_dma2_sr.htif = STM32FXXXDMA2_sr_htif;
	stm32fxxx_dma2_sr.clear_htif = STM32FXXXDMA2_sr_clear_htif;
	stm32fxxx_dma2_sr.teif = STM32FXXXDMA2_sr_teif;
	stm32fxxx_dma2_sr.clear_teif = STM32FXXXDMA2_sr_clear_teif;
	stm32fxxx_dma2_sr.dmeif = STM32FXXXDMA2_sr_dmeif;
	stm32fxxx_dma2_sr.clear_dmeif = STM32FXXXDMA2_sr_clear_dmeif;
	stm32fxxx_dma2_sr.feif = STM32FXXXDMA2_sr_feif;
	stm32fxxx_dma2_sr.clear_feif = STM32FXXXDMA2_sr_clear_feif;
	return &stm32fxxx_dma2_sr;
}
// DMA2 STREAM0 CR
void STM32FXXXDMA2_stream0_cr_chsel(uint8_t value)
{
	setreg(&DMA2_Stream0->CR, 3, 25, value);
}
void STM32FXXXDMA2_stream0_cr_mburst(uint8_t value)
{
	setreg(&DMA2_Stream0->CR, 2, 23, value);
}
void STM32FXXXDMA2_stream0_cr_pburst(uint8_t value)
{
	setreg(&DMA2_Stream0->CR, 2, 21, value);
}
void STM32FXXXDMA2_stream0_cr_ct(uint8_t bool)
{
	setreg(&DMA2_Stream0->CR, 1, 19, bool);
}
void STM32FXXXDMA2_stream0_cr_dbm(uint8_t bool)
{
	setreg(&DMA2_Stream0->CR, 1, 18, bool);
}
void STM32FXXXDMA2_stream0_cr_pl(uint8_t value)
{
	setreg(&DMA2_Stream0->CR, 2, 16, value);
}
void STM32FXXXDMA2_stream0_cr_pincos(uint8_t bool)
{
	setreg(&DMA2_Stream0->CR, 1, 15, bool);
}
void STM32FXXXDMA2_stream0_cr_msize(uint8_t value)
{
	setreg(&DMA2_Stream0->CR, 2, 13, value);
}
void STM32FXXXDMA2_stream0_cr_psize(uint8_t value)
{
	setreg(&DMA2_Stream0->CR, 2, 11, value);
}
void STM32FXXXDMA2_stream0_cr_minc(uint8_t bool)
{
	setreg(&DMA2_Stream0->CR, 1, 10, bool);
}
void STM32FXXXDMA2_stream0_cr_pinc(uint8_t bool)
{
	setreg(&DMA2_Stream0->CR, 1, 9, bool);
}
void STM32FXXXDMA2_stream0_cr_circ(uint8_t bool)
{
	setreg(&DMA2_Stream0->CR, 1, 8, bool);
}
void STM32FXXXDMA2_stream0_cr_dir(uint8_t value)
{
	setreg(&DMA2_Stream0->CR, 2, 7, value);
}
void STM32FXXXDMA2_stream0_cr_pfctrl(uint8_t bool)
{
	setreg(&DMA2_Stream0->CR, 1, 5, bool);
}
void STM32FXXXDMA2_stream0_cr_tcie(uint8_t bool)
{
	setreg(&DMA2_Stream0->CR, 1, 4, bool);
}
void STM32FXXXDMA2_stream0_cr_htie(uint8_t bool)
{
	setreg(&DMA2_Stream0->CR, 1, 3, bool);
}
void STM32FXXXDMA2_stream0_cr_teie(uint8_t bool)
{
	setreg(&DMA2_Stream0->CR, 1, 2, bool);
}
void STM32FXXXDMA2_stream0_cr_dmeie(uint8_t bool)
{
	setreg(&DMA2_Stream0->CR, 1, 1, bool);
}
void STM32FXXXDMA2_stream0_cr_en(uint8_t bool)
{
	setreg(&DMA2_Stream0->CR, 1, 0, bool);
}
/*** Inic DMA2 STREAM0 CR ***/
STM32FXXXDMA_STREAM_cr* stm32fxxx_dma2_stream0_cr_inic(void)
{

	// CR
	stm32fxxx_dma2_stream0_cr.chsel = STM32FXXXDMA2_stream0_cr_chsel;
	stm32fxxx_dma2_stream0_cr.mburst = STM32FXXXDMA2_stream0_cr_mburst;
	stm32fxxx_dma2_stream0_cr.pburst = STM32FXXXDMA2_stream0_cr_pburst;
	stm32fxxx_dma2_stream0_cr.ct = STM32FXXXDMA2_stream0_cr_ct;
	stm32fxxx_dma2_stream0_cr.dbm = STM32FXXXDMA2_stream0_cr_dbm;
	stm32fxxx_dma2_stream0_cr.pl = STM32FXXXDMA2_stream0_cr_pl;
	stm32fxxx_dma2_stream0_cr.pincos = STM32FXXXDMA2_stream0_cr_pincos;
	stm32fxxx_dma2_stream0_cr.msize = STM32FXXXDMA2_stream0_cr_msize;
	stm32fxxx_dma2_stream0_cr.psize = STM32FXXXDMA2_stream0_cr_psize;
	stm32fxxx_dma2_stream0_cr.minc = STM32FXXXDMA2_stream0_cr_minc;
	stm32fxxx_dma2_stream0_cr.pinc = STM32FXXXDMA2_stream0_cr_pinc;
	stm32fxxx_dma2_stream0_cr.circ = STM32FXXXDMA2_stream0_cr_circ;
	stm32fxxx_dma2_stream0_cr.dir = STM32FXXXDMA2_stream0_cr_dir;
	stm32fxxx_dma2_stream0_cr.pfctrl = STM32FXXXDMA2_stream0_cr_pfctrl;
	stm32fxxx_dma2_stream0_cr.tcie = STM32FXXXDMA2_stream0_cr_tcie;
	stm32fxxx_dma2_stream0_cr.htie = STM32FXXXDMA2_stream0_cr_htie;
	stm32fxxx_dma2_stream0_cr.teie = STM32FXXXDMA2_stream0_cr_teie;
	stm32fxxx_dma2_stream0_cr.dmeie = STM32FXXXDMA2_stream0_cr_dmeie;
	stm32fxxx_dma2_stream0_cr.en = STM32FXXXDMA2_stream0_cr_en;
	return &stm32fxxx_dma2_stream0_cr;
}
/*** Inic DMA2 STREAM0 Function ***/
void stm32fxxx_dma2_stream0_ndt(uint16_t value)
{
	DMA2_Stream0->NDTR = value;
}
void stm32fxxx_dma2_stream0_par(volatile long unsigned int periferal_addr)
{
	DMA2_Stream0->PAR = periferal_addr;
}
void stm32fxxx_dma2_stream0_m0a(volatile long unsigned int mem0_addr)
{
	DMA2_Stream0->M0AR = mem0_addr;
}
void stm32fxxx_dma2_stream0_m1a(volatile long unsigned int mem1_addr)
{
	DMA2_Stream0->M1AR = mem1_addr;
}
// DMA2 STREAM1 CR
void STM32FXXXDMA2_stream1_cr_chsel(uint8_t value)
{
	setreg(&DMA2_Stream1->CR, 3, 25, value);
}
void STM32FXXXDMA2_stream1_cr_mburst(uint8_t value)
{
	setreg(&DMA2_Stream1->CR, 2, 23, value);
}
void STM32FXXXDMA2_stream1_cr_pburst(uint8_t value)
{
	setreg(&DMA2_Stream1->CR, 2, 21, value);
}
void STM32FXXXDMA2_stream1_cr_ct(uint8_t bool)
{
	setreg(&DMA2_Stream1->CR, 1, 19, bool);
}
void STM32FXXXDMA2_stream1_cr_dbm(uint8_t bool)
{
	setreg(&DMA2_Stream1->CR, 1, 18, bool);
}
void STM32FXXXDMA2_stream1_cr_pl(uint8_t value)
{
	setreg(&DMA2_Stream1->CR, 2, 16, value);
}
void STM32FXXXDMA2_stream1_cr_pincos(uint8_t bool)
{
	setreg(&DMA2_Stream1->CR, 1, 15, bool);
}
void STM32FXXXDMA2_stream1_cr_msize(uint8_t value)
{
	setreg(&DMA2_Stream1->CR, 2, 13, value);
}
void STM32FXXXDMA2_stream1_cr_psize(uint8_t value)
{
	setreg(&DMA2_Stream1->CR, 2, 11, value);
}
void STM32FXXXDMA2_stream1_cr_minc(uint8_t bool)
{
	setreg(&DMA2_Stream1->CR, 1, 10, bool);
}
void STM32FXXXDMA2_stream1_cr_pinc(uint8_t bool)
{
	setreg(&DMA2_Stream1->CR, 1, 9, bool);
}
void STM32FXXXDMA2_stream1_cr_circ(uint8_t bool)
{
	setreg(&DMA2_Stream1->CR, 1, 8, bool);
}
void STM32FXXXDMA2_stream1_cr_dir(uint8_t value)
{
	setreg(&DMA2_Stream1->CR, 2, 7, value);
}
void STM32FXXXDMA2_stream1_cr_pfctrl(uint8_t bool)
{
	setreg(&DMA2_Stream1->CR, 1, 5, bool);
}
void STM32FXXXDMA2_stream1_cr_tcie(uint8_t bool)
{
	setreg(&DMA2_Stream1->CR, 1, 4, bool);
}
void STM32FXXXDMA2_stream1_cr_htie(uint8_t bool)
{
	setreg(&DMA2_Stream1->CR, 1, 3, bool);
}
void STM32FXXXDMA2_stream1_cr_teie(uint8_t bool)
{
	setreg(&DMA2_Stream1->CR, 1, 2, bool);
}
void STM32FXXXDMA2_stream1_cr_dmeie(uint8_t bool)
{
	setreg(&DMA2_Stream1->CR, 1, 1, bool);
}
void STM32FXXXDMA2_stream1_cr_en(uint8_t bool)
{
	setreg(&DMA2_Stream1->CR, 1, 0, bool);
}
/*** Inic DMA2 STREAM1 CR ***/
STM32FXXXDMA_STREAM_cr* stm32fxxx_dma2_stream1_cr_inic(void)
{

	// CR
	stm32fxxx_dma2_stream1_cr.chsel = STM32FXXXDMA2_stream1_cr_chsel;
	stm32fxxx_dma2_stream1_cr.mburst = STM32FXXXDMA2_stream1_cr_mburst;
	stm32fxxx_dma2_stream1_cr.pburst = STM32FXXXDMA2_stream1_cr_pburst;
	stm32fxxx_dma2_stream1_cr.ct = STM32FXXXDMA2_stream1_cr_ct;
	stm32fxxx_dma2_stream1_cr.dbm = STM32FXXXDMA2_stream1_cr_dbm;
	stm32fxxx_dma2_stream1_cr.pl = STM32FXXXDMA2_stream1_cr_pl;
	stm32fxxx_dma2_stream1_cr.pincos = STM32FXXXDMA2_stream1_cr_pincos;
	stm32fxxx_dma2_stream1_cr.msize = STM32FXXXDMA2_stream1_cr_msize;
	stm32fxxx_dma2_stream1_cr.psize = STM32FXXXDMA2_stream1_cr_psize;
	stm32fxxx_dma2_stream1_cr.minc = STM32FXXXDMA2_stream1_cr_minc;
	stm32fxxx_dma2_stream1_cr.pinc = STM32FXXXDMA2_stream1_cr_pinc;
	stm32fxxx_dma2_stream1_cr.circ = STM32FXXXDMA2_stream1_cr_circ;
	stm32fxxx_dma2_stream1_cr.dir = STM32FXXXDMA2_stream1_cr_dir;
	stm32fxxx_dma2_stream1_cr.pfctrl = STM32FXXXDMA2_stream1_cr_pfctrl;
	stm32fxxx_dma2_stream1_cr.tcie = STM32FXXXDMA2_stream1_cr_tcie;
	stm32fxxx_dma2_stream1_cr.htie = STM32FXXXDMA2_stream1_cr_htie;
	stm32fxxx_dma2_stream1_cr.teie = STM32FXXXDMA2_stream1_cr_teie;
	stm32fxxx_dma2_stream1_cr.dmeie = STM32FXXXDMA2_stream1_cr_dmeie;
	stm32fxxx_dma2_stream1_cr.en = STM32FXXXDMA2_stream1_cr_en;
	return &stm32fxxx_dma2_stream1_cr;
}
/*** Inic DMA2 STREAM1 Function ***/
void stm32fxxx_dma2_stream1_ndt(uint16_t value)
{
	DMA2_Stream1->NDTR = value;
}
void stm32fxxx_dma2_stream1_par(volatile long unsigned int periferal_addr)
{
	DMA2_Stream1->PAR = periferal_addr;
}
void stm32fxxx_dma2_stream1_m0a(volatile long unsigned int mem0_addr)
{
	DMA2_Stream1->M0AR = mem0_addr;
}
void stm32fxxx_dma2_stream1_m1a(volatile long unsigned int mem1_addr)
{
	DMA2_Stream1->M1AR = mem1_addr;
}
// DMA2 STREAM2 CR
void STM32FXXXDMA2_stream2_cr_chsel(uint8_t value)
{
	setreg(&DMA2_Stream2->CR, 3, 25, value);
}
void STM32FXXXDMA2_stream2_cr_mburst(uint8_t value)
{
	setreg(&DMA2_Stream2->CR, 2, 23, value);
}
void STM32FXXXDMA2_stream2_cr_pburst(uint8_t value)
{
	setreg(&DMA2_Stream2->CR, 2, 21, value);
}
void STM32FXXXDMA2_stream2_cr_ct(uint8_t bool)
{
	setreg(&DMA2_Stream2->CR, 1, 19, bool);
}
void STM32FXXXDMA2_stream2_cr_dbm(uint8_t bool)
{
	setreg(&DMA2_Stream2->CR, 1, 18, bool);
}
void STM32FXXXDMA2_stream2_cr_pl(uint8_t value)
{
	setreg(&DMA2_Stream2->CR, 2, 16, value);
}
void STM32FXXXDMA2_stream2_cr_pincos(uint8_t bool)
{
	setreg(&DMA2_Stream2->CR, 1, 15, bool);
}
void STM32FXXXDMA2_stream2_cr_msize(uint8_t value)
{
	setreg(&DMA2_Stream2->CR, 2, 13, value);
}
void STM32FXXXDMA2_stream2_cr_psize(uint8_t value)
{
	setreg(&DMA2_Stream2->CR, 2, 11, value);
}
void STM32FXXXDMA2_stream2_cr_minc(uint8_t bool)
{
	setreg(&DMA2_Stream2->CR, 1, 10, bool);
}
void STM32FXXXDMA2_stream2_cr_pinc(uint8_t bool)
{
	setreg(&DMA2_Stream2->CR, 1, 9, bool);
}
void STM32FXXXDMA2_stream2_cr_circ(uint8_t bool)
{
	setreg(&DMA2_Stream2->CR, 1, 8, bool);
}
void STM32FXXXDMA2_stream2_cr_dir(uint8_t value)
{
	setreg(&DMA2_Stream2->CR, 2, 7, value);
}
void STM32FXXXDMA2_stream2_cr_pfctrl(uint8_t bool)
{
	setreg(&DMA2_Stream2->CR, 1, 5, bool);
}
void STM32FXXXDMA2_stream2_cr_tcie(uint8_t bool)
{
	setreg(&DMA2_Stream2->CR, 1, 4, bool);
}
void STM32FXXXDMA2_stream2_cr_htie(uint8_t bool)
{
	setreg(&DMA2_Stream2->CR, 1, 3, bool);
}
void STM32FXXXDMA2_stream2_cr_teie(uint8_t bool)
{
	setreg(&DMA2_Stream2->CR, 1, 2, bool);
}
void STM32FXXXDMA2_stream2_cr_dmeie(uint8_t bool)
{
	setreg(&DMA2_Stream2->CR, 1, 1, bool);
}
void STM32FXXXDMA2_stream2_cr_en(uint8_t bool)
{
	setreg(&DMA2_Stream2->CR, 1, 0, bool);
}
/*** Inic DMA2 STREAM2 CR ***/
STM32FXXXDMA_STREAM_cr* stm32fxxx_dma2_stream2_cr_inic(void)
{

	// CR
	stm32fxxx_dma2_stream2_cr.chsel = STM32FXXXDMA2_stream2_cr_chsel;
	stm32fxxx_dma2_stream2_cr.mburst = STM32FXXXDMA2_stream2_cr_mburst;
	stm32fxxx_dma2_stream2_cr.pburst = STM32FXXXDMA2_stream2_cr_pburst;
	stm32fxxx_dma2_stream2_cr.ct = STM32FXXXDMA2_stream2_cr_ct;
	stm32fxxx_dma2_stream2_cr.dbm = STM32FXXXDMA2_stream2_cr_dbm;
	stm32fxxx_dma2_stream2_cr.pl = STM32FXXXDMA2_stream2_cr_pl;
	stm32fxxx_dma2_stream2_cr.pincos = STM32FXXXDMA2_stream2_cr_pincos;
	stm32fxxx_dma2_stream2_cr.msize = STM32FXXXDMA2_stream2_cr_msize;
	stm32fxxx_dma2_stream2_cr.psize = STM32FXXXDMA2_stream2_cr_psize;
	stm32fxxx_dma2_stream2_cr.minc = STM32FXXXDMA2_stream2_cr_minc;
	stm32fxxx_dma2_stream2_cr.pinc = STM32FXXXDMA2_stream2_cr_pinc;
	stm32fxxx_dma2_stream2_cr.circ = STM32FXXXDMA2_stream2_cr_circ;
	stm32fxxx_dma2_stream2_cr.dir = STM32FXXXDMA2_stream2_cr_dir;
	stm32fxxx_dma2_stream2_cr.pfctrl = STM32FXXXDMA2_stream2_cr_pfctrl;
	stm32fxxx_dma2_stream2_cr.tcie = STM32FXXXDMA2_stream2_cr_tcie;
	stm32fxxx_dma2_stream2_cr.htie = STM32FXXXDMA2_stream2_cr_htie;
	stm32fxxx_dma2_stream2_cr.teie = STM32FXXXDMA2_stream2_cr_teie;
	stm32fxxx_dma2_stream2_cr.dmeie = STM32FXXXDMA2_stream2_cr_dmeie;
	stm32fxxx_dma2_stream2_cr.en = STM32FXXXDMA2_stream2_cr_en;
	return &stm32fxxx_dma2_stream2_cr;
}
/*** Inic DMA2 STREAM2 Function ***/
void stm32fxxx_dma2_stream2_ndt(uint16_t value)
{
	DMA2_Stream2->NDTR = value;
}
void stm32fxxx_dma2_stream2_par(volatile long unsigned int periferal_addr)
{
	DMA2_Stream2->PAR = periferal_addr;
}
void stm32fxxx_dma2_stream2_m0a(volatile long unsigned int mem0_addr)
{
	DMA2_Stream2->M0AR = mem0_addr;
}
void stm32fxxx_dma2_stream2_m1a(volatile long unsigned int mem1_addr)
{
	DMA2_Stream2->M1AR = mem1_addr;
}
// DMA2 STREAM3 CR
void STM32FXXXDMA2_stream3_cr_chsel(uint8_t value)
{
	setreg(&DMA2_Stream3->CR, 3, 25, value);
}
void STM32FXXXDMA2_stream3_cr_mburst(uint8_t value)
{
	setreg(&DMA2_Stream3->CR, 2, 23, value);
}
void STM32FXXXDMA2_stream3_cr_pburst(uint8_t value)
{
	setreg(&DMA2_Stream3->CR, 2, 21, value);
}
void STM32FXXXDMA2_stream3_cr_ct(uint8_t bool)
{
	setreg(&DMA2_Stream3->CR, 1, 19, bool);
}
void STM32FXXXDMA2_stream3_cr_dbm(uint8_t bool)
{
	setreg(&DMA2_Stream3->CR, 1, 18, bool);
}
void STM32FXXXDMA2_stream3_cr_pl(uint8_t value)
{
	setreg(&DMA2_Stream3->CR, 2, 16, value);
}
void STM32FXXXDMA2_stream3_cr_pincos(uint8_t bool)
{
	setreg(&DMA2_Stream3->CR, 1, 15, bool);
}
void STM32FXXXDMA2_stream3_cr_msize(uint8_t value)
{
	setreg(&DMA2_Stream3->CR, 2, 13, value);
}
void STM32FXXXDMA2_stream3_cr_psize(uint8_t value)
{
	setreg(&DMA2_Stream3->CR, 2, 11, value);
}
void STM32FXXXDMA2_stream3_cr_minc(uint8_t bool)
{
	setreg(&DMA2_Stream3->CR, 1, 10, bool);
}
void STM32FXXXDMA2_stream3_cr_pinc(uint8_t bool)
{
	setreg(&DMA2_Stream3->CR, 1, 9, bool);
}
void STM32FXXXDMA2_stream3_cr_circ(uint8_t bool)
{
	setreg(&DMA2_Stream3->CR, 1, 8, bool);
}
void STM32FXXXDMA2_stream3_cr_dir(uint8_t value)
{
	setreg(&DMA2_Stream3->CR, 2, 7, value);
}
void STM32FXXXDMA2_stream3_cr_pfctrl(uint8_t bool)
{
	setreg(&DMA2_Stream3->CR, 1, 5, bool);
}
void STM32FXXXDMA2_stream3_cr_tcie(uint8_t bool)
{
	setreg(&DMA2_Stream3->CR, 1, 4, bool);
}
void STM32FXXXDMA2_stream3_cr_htie(uint8_t bool)
{
	setreg(&DMA2_Stream3->CR, 1, 3, bool);
}
void STM32FXXXDMA2_stream3_cr_teie(uint8_t bool)
{
	setreg(&DMA2_Stream3->CR, 1, 2, bool);
}
void STM32FXXXDMA2_stream3_cr_dmeie(uint8_t bool)
{
	setreg(&DMA2_Stream3->CR, 1, 1, bool);
}
void STM32FXXXDMA2_stream3_cr_en(uint8_t bool)
{
	setreg(&DMA2_Stream3->CR, 1, 0, bool);
}
/*** Inic DMA2 STREAM3 CR ***/
STM32FXXXDMA_STREAM_cr* stm32fxxx_dma2_stream3_cr_inic(void)
{

