BitNibble/Source_Library/stm32fxxxlib/Library/Src/stm32fxxxdma.c
	// CR
	stm32fxxx_dma2_stream3_cr.chsel = STM32FXXXDMA2_stream3_cr_chsel;
	stm32fxxx_dma2_stream3_cr.mburst = STM32FXXXDMA2_stream3_cr_mburst;
	stm32fxxx_dma2_stream3_cr.pburst = STM32FXXXDMA2_stream3_cr_pburst;
	stm32fxxx_dma2_stream3_cr.ct = STM32FXXXDMA2_stream3_cr_ct;
	stm32fxxx_dma2_stream3_cr.dbm = STM32FXXXDMA2_stream3_cr_dbm;
	stm32fxxx_dma2_stream3_cr.pl = STM32FXXXDMA2_stream3_cr_pl;
	stm32fxxx_dma2_stream3_cr.pincos = STM32FXXXDMA2_stream3_cr_pincos;
	stm32fxxx_dma2_stream3_cr.msize = STM32FXXXDMA2_stream3_cr_msize;
	stm32fxxx_dma2_stream3_cr.psize = STM32FXXXDMA2_stream3_cr_psize;
	stm32fxxx_dma2_stream3_cr.minc = STM32FXXXDMA2_stream3_cr_minc;
	stm32fxxx_dma2_stream3_cr.pinc = STM32FXXXDMA2_stream3_cr_pinc;
	stm32fxxx_dma2_stream3_cr.circ = STM32FXXXDMA2_stream3_cr_circ;
	stm32fxxx_dma2_stream3_cr.dir = STM32FXXXDMA2_stream3_cr_dir;
	stm32fxxx_dma2_stream3_cr.pfctrl = STM32FXXXDMA2_stream3_cr_pfctrl;
	stm32fxxx_dma2_stream3_cr.tcie = STM32FXXXDMA2_stream3_cr_tcie;
	stm32fxxx_dma2_stream3_cr.htie = STM32FXXXDMA2_stream3_cr_htie;
	stm32fxxx_dma2_stream3_cr.teie = STM32FXXXDMA2_stream3_cr_teie;
	stm32fxxx_dma2_stream3_cr.dmeie = STM32FXXXDMA2_stream3_cr_dmeie;
	stm32fxxx_dma2_stream3_cr.en = STM32FXXXDMA2_stream3_cr_en;
	return &stm32fxxx_dma2_stream3_cr;
}
/*** Inic DMA2 STREAM3 Function ***/
void stm32fxxx_dma2_stream3_ndt(uint16_t value)
{
	DMA2_Stream3->NDTR = value;
}
void stm32fxxx_dma2_stream3_par(volatile long unsigned int periferal_addr)
{
	DMA2_Stream3->PAR = periferal_addr;
}
void stm32fxxx_dma2_stream3_m0a(volatile long unsigned int mem0_addr)
{
	DMA2_Stream3->M0AR = mem0_addr;
}
void stm32fxxx_dma2_stream3_m1a(volatile long unsigned int mem1_addr)
{
	DMA2_Stream3->M1AR = mem1_addr;
}
// DMA2 STREAM4 CR
void STM32FXXXDMA2_stream4_cr_chsel(uint8_t value)
{
	setreg(&DMA2_Stream4->CR, 3, 25, value);
}
void STM32FXXXDMA2_stream4_cr_mburst(uint8_t value)
{
	setreg(&DMA2_Stream4->CR, 2, 23, value);
}
void STM32FXXXDMA2_stream4_cr_pburst(uint8_t value)
{
	setreg(&DMA2_Stream4->CR, 2, 21, value);
}
void STM32FXXXDMA2_stream4_cr_ct(uint8_t bool)
{
	setreg(&DMA2_Stream4->CR, 1, 19, bool);
}
void STM32FXXXDMA2_stream4_cr_dbm(uint8_t bool)
{
	setreg(&DMA2_Stream4->CR, 1, 18, bool);
}
void STM32FXXXDMA2_stream4_cr_pl(uint8_t value)
{
	setreg(&DMA2_Stream4->CR, 2, 16, value);
}
void STM32FXXXDMA2_stream4_cr_pincos(uint8_t bool)
{
	setreg(&DMA2_Stream4->CR, 1, 15, bool);
}
void STM32FXXXDMA2_stream4_cr_msize(uint8_t value)
{
	setreg(&DMA2_Stream4->CR, 2, 13, value);
}
void STM32FXXXDMA2_stream4_cr_psize(uint8_t value)
{
	setreg(&DMA2_Stream4->CR, 2, 11, value);
}
void STM32FXXXDMA2_stream4_cr_minc(uint8_t bool)
{
	setreg(&DMA2_Stream4->CR, 1, 10, bool);
}
void STM32FXXXDMA2_stream4_cr_pinc(uint8_t bool)
{
	setreg(&DMA2_Stream4->CR, 1, 9, bool);
}
void STM32FXXXDMA2_stream4_cr_circ(uint8_t bool)
{
	setreg(&DMA2_Stream4->CR, 1, 8, bool);
}
void STM32FXXXDMA2_stream4_cr_dir(uint8_t value)
{
	setreg(&DMA2_Stream4->CR, 2, 7, value);
}
void STM32FXXXDMA2_stream4_cr_pfctrl(uint8_t bool)
{
	setreg(&DMA2_Stream4->CR, 1, 5, bool);
}
void STM32FXXXDMA2_stream4_cr_tcie(uint8_t bool)
{
	setreg(&DMA2_Stream4->CR, 1, 4, bool);
}
void STM32FXXXDMA2_stream4_cr_htie(uint8_t bool)
{
	setreg(&DMA2_Stream4->CR, 1, 3, bool);
}
void STM32FXXXDMA2_stream4_cr_teie(uint8_t bool)
{
	setreg(&DMA2_Stream4->CR, 1, 2, bool);
}
void STM32FXXXDMA2_stream4_cr_dmeie(uint8_t bool)
{
	setreg(&DMA2_Stream4->CR, 1, 1, bool);
}
void STM32FXXXDMA2_stream4_cr_en(uint8_t bool)
{
	setreg(&DMA2_Stream4->CR, 1, 0, bool);
}
/*** Inic DMA2 STREAM4 CR ***/
STM32FXXXDMA_STREAM_cr* stm32fxxx_dma2_stream4_cr_inic(void)
{

	// CR
	stm32fxxx_dma2_stream4_cr.chsel = STM32FXXXDMA2_stream4_cr_chsel;
	stm32fxxx_dma2_stream4_cr.mburst = STM32FXXXDMA2_stream4_cr_mburst;
	stm32fxxx_dma2_stream4_cr.pburst = STM32FXXXDMA2_stream4_cr_pburst;
	stm32fxxx_dma2_stream4_cr.ct = STM32FXXXDMA2_stream4_cr_ct;
	stm32fxxx_dma2_stream4_cr.dbm = STM32FXXXDMA2_stream4_cr_dbm;
	stm32fxxx_dma2_stream4_cr.pl = STM32FXXXDMA2_stream4_cr_pl;
	stm32fxxx_dma2_stream4_cr.pincos = STM32FXXXDMA2_stream4_cr_pincos;
	stm32fxxx_dma2_stream4_cr.msize = STM32FXXXDMA2_stream4_cr_msize;
	stm32fxxx_dma2_stream4_cr.psize = STM32FXXXDMA2_stream4_cr_psize;
	stm32fxxx_dma2_stream4_cr.minc = STM32FXXXDMA2_stream4_cr_minc;
	stm32fxxx_dma2_stream4_cr.pinc = STM32FXXXDMA2_stream4_cr_pinc;
	stm32fxxx_dma2_stream4_cr.circ = STM32FXXXDMA2_stream4_cr_circ;
	stm32fxxx_dma2_stream4_cr.dir = STM32FXXXDMA2_stream4_cr_dir;
	stm32fxxx_dma2_stream4_cr.pfctrl = STM32FXXXDMA2_stream4_cr_pfctrl;
	stm32fxxx_dma2_stream4_cr.tcie = STM32FXXXDMA2_stream4_cr_tcie;
	stm32fxxx_dma2_stream4_cr.htie = STM32FXXXDMA2_stream4_cr_htie;
	stm32fxxx_dma2_stream4_cr.teie = STM32FXXXDMA2_stream4_cr_teie;
	stm32fxxx_dma2_stream4_cr.dmeie = STM32FXXXDMA2_stream4_cr_dmeie;
	stm32fxxx_dma2_stream4_cr.en = STM32FXXXDMA2_stream4_cr_en;
	return &stm32fxxx_dma2_stream4_cr;
}
/*** Inic DMA2 STREAM4 Function ***/
void stm32fxxx_dma2_stream4_ndt(uint16_t value)
{
	DMA2_Stream4->NDTR = value;
}
void stm32fxxx_dma2_stream4_par(volatile long unsigned int periferal_addr)
{
	DMA2_Stream4->PAR = periferal_addr;
}
void stm32fxxx_dma2_stream4_m0a(volatile long unsigned int mem0_addr)
{
	DMA2_Stream4->M0AR = mem0_addr;
}
void stm32fxxx_dma2_stream4_m1a(volatile long unsigned int mem1_addr)
{
	DMA2_Stream4->M1AR = mem1_addr;
}
// DMA2 STREAM5 CR
void STM32FXXXDMA2_stream5_cr_chsel(uint8_t value)
{
	setreg(&DMA2_Stream5->CR, 3, 25, value);
}
void STM32FXXXDMA2_stream5_cr_mburst(uint8_t value)
{
	setreg(&DMA2_Stream5->CR, 2, 23, value);
}
void STM32FXXXDMA2_stream5_cr_pburst(uint8_t value)
{
	setreg(&DMA2_Stream5->CR, 2, 21, value);
}
void STM32FXXXDMA2_stream5_cr_ct(uint8_t bool)
{
	setreg(&DMA2_Stream5->CR, 1, 19, bool);
}
void STM32FXXXDMA2_stream5_cr_dbm(uint8_t bool)
{
	setreg(&DMA2_Stream5->CR, 1, 18, bool);
}
void STM32FXXXDMA2_stream5_cr_pl(uint8_t value)
{
	setreg(&DMA2_Stream5->CR, 2, 16, value);
}
void STM32FXXXDMA2_stream5_cr_pincos(uint8_t bool)
{
	setreg(&DMA2_Stream5->CR, 1, 15, bool);
}
void STM32FXXXDMA2_stream5_cr_msize(uint8_t value)
{
	setreg(&DMA2_Stream5->CR, 2, 13, value);
}
void STM32FXXXDMA2_stream5_cr_psize(uint8_t value)
{
	setreg(&DMA2_Stream5->CR, 2, 11, value);
}
void STM32FXXXDMA2_stream5_cr_minc(uint8_t bool)
{
	setreg(&DMA2_Stream5->CR, 1, 10, bool);
}
void STM32FXXXDMA2_stream5_cr_pinc(uint8_t bool)
{
	setreg(&DMA2_Stream5->CR, 1, 9, bool);
}
void STM32FXXXDMA2_stream5_cr_circ(uint8_t bool)
{
	setreg(&DMA2_Stream5->CR, 1, 8, bool);
}
void STM32FXXXDMA2_stream5_cr_dir(uint8_t value)
{
	setreg(&DMA2_Stream5->CR, 2, 7, value);
}
void STM32FXXXDMA2_stream5_cr_pfctrl(uint8_t bool)
{
	setreg(&DMA2_Stream5->CR, 1, 5, bool);
}
void STM32FXXXDMA2_stream5_cr_tcie(uint8_t bool)
{
	setreg(&DMA2_Stream5->CR, 1, 4, bool);
}
void STM32FXXXDMA2_stream5_cr_htie(uint8_t bool)
{
	setreg(&DMA2_Stream5->CR, 1, 3, bool);
}
void STM32FXXXDMA2_stream5_cr_teie(uint8_t bool)
{
	setreg(&DMA2_Stream5->CR, 1, 2, bool);
}
void STM32FXXXDMA2_stream5_cr_dmeie(uint8_t bool)
{
	setreg(&DMA2_Stream5->CR, 1, 1, bool);
}
void STM32FXXXDMA2_stream5_cr_en(uint8_t bool)
{
	setreg(&DMA2_Stream5->CR, 1, 0, bool);
}
/*** Inic DMA2 STREAM5 CR ***/
STM32FXXXDMA_STREAM_cr* stm32fxxx_dma2_stream5_cr_inic(void)
{

	// CR
	stm32fxxx_dma2_stream5_cr.chsel = STM32FXXXDMA2_stream5_cr_chsel;
	stm32fxxx_dma2_stream5_cr.mburst = STM32FXXXDMA2_stream5_cr_mburst;
	stm32fxxx_dma2_stream5_cr.pburst = STM32FXXXDMA2_stream5_cr_pburst;
	stm32fxxx_dma2_stream5_cr.ct = STM32FXXXDMA2_stream5_cr_ct;
	stm32fxxx_dma2_stream5_cr.dbm = STM32FXXXDMA2_stream5_cr_dbm;
	stm32fxxx_dma2_stream5_cr.pl = STM32FXXXDMA2_stream5_cr_pl;
	stm32fxxx_dma2_stream5_cr.pincos = STM32FXXXDMA2_stream5_cr_pincos;
	stm32fxxx_dma2_stream5_cr.msize = STM32FXXXDMA2_stream5_cr_msize;
	stm32fxxx_dma2_stream5_cr.psize = STM32FXXXDMA2_stream5_cr_psize;
	stm32fxxx_dma2_stream5_cr.minc = STM32FXXXDMA2_stream5_cr_minc;
	stm32fxxx_dma2_stream5_cr.pinc = STM32FXXXDMA2_stream5_cr_pinc;
	stm32fxxx_dma2_stream5_cr.circ = STM32FXXXDMA2_stream5_cr_circ;
	stm32fxxx_dma2_stream5_cr.dir = STM32FXXXDMA2_stream5_cr_dir;
	stm32fxxx_dma2_stream5_cr.pfctrl = STM32FXXXDMA2_stream5_cr_pfctrl;
	stm32fxxx_dma2_stream5_cr.tcie = STM32FXXXDMA2_stream5_cr_tcie;
	stm32fxxx_dma2_stream5_cr.htie = STM32FXXXDMA2_stream5_cr_htie;
	stm32fxxx_dma2_stream5_cr.teie = STM32FXXXDMA2_stream5_cr_teie;
	stm32fxxx_dma2_stream5_cr.dmeie = STM32FXXXDMA2_stream5_cr_dmeie;
	stm32fxxx_dma2_stream5_cr.en = STM32FXXXDMA2_stream5_cr_en;
	return &stm32fxxx_dma2_stream5_cr;
}
/*** Inic DMA2 STREAM5 Function ***/
void stm32fxxx_dma2_stream5_ndt(uint16_t value)
{
	DMA2_Stream5->NDTR = value;
}
void stm32fxxx_dma2_stream5_par(volatile long unsigned int periferal_addr)
{
	DMA2_Stream5->PAR = periferal_addr;
}
void stm32fxxx_dma2_stream5_m0a(volatile long unsigned int mem0_addr)
{
	DMA2_Stream5->M0AR = mem0_addr;
}
void stm32fxxx_dma2_stream5_m1a(volatile long unsigned int mem1_addr)
{
	DMA2_Stream5->M1AR = mem1_addr;
}
// DMA2 STREAM6 CR
void STM32FXXXDMA2_stream6_cr_chsel(uint8_t value)
{
	setreg(&DMA2_Stream6->CR, 3, 25, value);
}
void STM32FXXXDMA2_stream6_cr_mburst(uint8_t value)
{
	setreg(&DMA2_Stream6->CR, 2, 23, value);
}
void STM32FXXXDMA2_stream6_cr_pburst(uint8_t value)
{
	setreg(&DMA2_Stream6->CR, 2, 21, value);
}
void STM32FXXXDMA2_stream6_cr_ct(uint8_t bool)
{
	setreg(&DMA2_Stream6->CR, 1, 19, bool);
}
void STM32FXXXDMA2_stream6_cr_dbm(uint8_t bool)
{
	setreg(&DMA2_Stream6->CR, 1, 18, bool);
}
void STM32FXXXDMA2_stream6_cr_pl(uint8_t value)
{
	setreg(&DMA2_Stream6->CR, 2, 16, value);
}
void STM32FXXXDMA2_stream6_cr_pincos(uint8_t bool)
{
	setreg(&DMA2_Stream6->CR, 1, 15, bool);
}
void STM32FXXXDMA2_stream6_cr_msize(uint8_t value)
{
	setreg(&DMA2_Stream6->CR, 2, 13, value);
}
void STM32FXXXDMA2_stream6_cr_psize(uint8_t value)
{
	setreg(&DMA2_Stream6->CR, 2, 11, value);
}
void STM32FXXXDMA2_stream6_cr_minc(uint8_t bool)
{
	setreg(&DMA2_Stream6->CR, 1, 10, bool);
}
void STM32FXXXDMA2_stream6_cr_pinc(uint8_t bool)
{
	setreg(&DMA2_Stream6->CR, 1, 9, bool);
}
void STM32FXXXDMA2_stream6_cr_circ(uint8_t bool)
{
	setreg(&DMA2_Stream6->CR, 1, 8, bool);
}
void STM32FXXXDMA2_stream6_cr_dir(uint8_t value)
{
	setreg(&DMA2_Stream6->CR, 2, 7, value);
}
void STM32FXXXDMA2_stream6_cr_pfctrl(uint8_t bool)
{
	setreg(&DMA2_Stream6->CR, 1, 5, bool);
}
void STM32FXXXDMA2_stream6_cr_tcie(uint8_t bool)
{
	setreg(&DMA2_Stream6->CR, 1, 4, bool);
}
void STM32FXXXDMA2_stream6_cr_htie(uint8_t bool)
{
	setreg(&DMA2_Stream6->CR, 1, 3, bool);
}
void STM32FXXXDMA2_stream6_cr_teie(uint8_t bool)
{
	setreg(&DMA2_Stream6->CR, 1, 2, bool);
}
void STM32FXXXDMA2_stream6_cr_dmeie(uint8_t bool)
{
	setreg(&DMA2_Stream6->CR, 1, 1, bool);
}
void STM32FXXXDMA2_stream6_cr_en(uint8_t bool)
{
	setreg(&DMA2_Stream6->CR, 1, 0, bool);
}
/*** Inic DMA2 STREAM6 CR ***/
STM32FXXXDMA_STREAM_cr* stm32fxxx_dma2_stream6_cr_inic(void)
{

	// CR
	stm32fxxx_dma2_stream6_cr.chsel = STM32FXXXDMA2_stream6_cr_chsel;
	stm32fxxx_dma2_stream6_cr.mburst = STM32FXXXDMA2_stream6_cr_mburst;
	stm32fxxx_dma2_stream6_cr.pburst = STM32FXXXDMA2_stream6_cr_pburst;
	stm32fxxx_dma2_stream6_cr.ct = STM32FXXXDMA2_stream6_cr_ct;
	stm32fxxx_dma2_stream6_cr.dbm = STM32FXXXDMA2_stream6_cr_dbm;
	stm32fxxx_dma2_stream6_cr.pl = STM32FXXXDMA2_stream6_cr_pl;
	stm32fxxx_dma2_stream6_cr.pincos = STM32FXXXDMA2_stream6_cr_pincos;
	stm32fxxx_dma2_stream6_cr.msize = STM32FXXXDMA2_stream6_cr_msize;
	stm32fxxx_dma2_stream6_cr.psize = STM32FXXXDMA2_stream6_cr_psize;
	stm32fxxx_dma2_stream6_cr.minc = STM32FXXXDMA2_stream6_cr_minc;
	stm32fxxx_dma2_stream6_cr.pinc = STM32FXXXDMA2_stream6_cr_pinc;
	stm32fxxx_dma2_stream6_cr.circ = STM32FXXXDMA2_stream6_cr_circ;
	stm32fxxx_dma2_stream6_cr.dir = STM32FXXXDMA2_stream6_cr_dir;
	stm32fxxx_dma2_stream6_cr.pfctrl = STM32FXXXDMA2_stream6_cr_pfctrl;
	stm32fxxx_dma2_stream6_cr.tcie = STM32FXXXDMA2_stream6_cr_tcie;
	stm32fxxx_dma2_stream6_cr.htie = STM32FXXXDMA2_stream6_cr_htie;
	stm32fxxx_dma2_stream6_cr.teie = STM32FXXXDMA2_stream6_cr_teie;
	stm32fxxx_dma2_stream6_cr.dmeie = STM32FXXXDMA2_stream6_cr_dmeie;
	stm32fxxx_dma2_stream6_cr.en = STM32FXXXDMA2_stream6_cr_en;
	return &stm32fxxx_dma2_stream6_cr;
}
/*** Inic DMA2 STREAM6 Function ***/
void stm32fxxx_dma2_stream6_ndt(uint16_t value)
{
	DMA2_Stream6->NDTR = value;
}
void stm32fxxx_dma2_stream6_par(volatile long unsigned int periferal_addr)
{
	DMA2_Stream6->PAR = periferal_addr;
}
void stm32fxxx_dma2_stream6_m0a(volatile long unsigned int mem0_addr)
{
	DMA2_Stream6->M0AR = mem0_addr;
}
void stm32fxxx_dma2_stream6_m1a(volatile long unsigned int mem1_addr)
{
	DMA2_Stream6->M1AR = mem1_addr;
}
// DMA2 STREAM7 CR
void STM32FXXXDMA2_stream7_cr_chsel(uint8_t value)
{
	setreg(&DMA2_Stream7->CR, 3, 25, value);
}
void STM32FXXXDMA2_stream7_cr_mburst(uint8_t value)
{
	setreg(&DMA2_Stream7->CR, 2, 23, value);
}
void STM32FXXXDMA2_stream7_cr_pburst(uint8_t value)
{
	setreg(&DMA2_Stream7->CR, 2, 21, value);
}
void STM32FXXXDMA2_stream7_cr_ct(uint8_t bool)
{
	setreg(&DMA2_Stream7->CR, 1, 19, bool);
}
void STM32FXXXDMA2_stream7_cr_dbm(uint8_t bool)
{
	setreg(&DMA2_Stream7->CR, 1, 18, bool);
}
void STM32FXXXDMA2_stream7_cr_pl(uint8_t value)
{
	setreg(&DMA2_Stream7->CR, 2, 16, value);
}
void STM32FXXXDMA2_stream7_cr_pincos(uint8_t bool)
{
	setreg(&DMA2_Stream7->CR, 1, 15, bool);
}
void STM32FXXXDMA2_stream7_cr_msize(uint8_t value)
{
	setreg(&DMA2_Stream7->CR, 2, 13, value);
}
void STM32FXXXDMA2_stream7_cr_psize(uint8_t value)
{
	setreg(&DMA2_Stream7->CR, 2, 11, value);
}
void STM32FXXXDMA2_stream7_cr_minc(uint8_t bool)
{
	setreg(&DMA2_Stream7->CR, 1, 10, bool);
}
void STM32FXXXDMA2_stream7_cr_pinc(uint8_t bool)
{
	setreg(&DMA2_Stream7->CR, 1, 9, bool);
}
void STM32FXXXDMA2_stream7_cr_circ(uint8_t bool)
{
	setreg(&DMA2_Stream7->CR, 1, 8, bool);
}
void STM32FXXXDMA2_stream7_cr_dir(uint8_t value)
{
	setreg(&DMA2_Stream7->CR, 2, 7, value);
}
void STM32FXXXDMA2_stream7_cr_pfctrl(uint8_t bool)
{
	setreg(&DMA2_Stream7->CR, 1, 5, bool);
}
void STM32FXXXDMA2_stream7_cr_tcie(uint8_t bool)
{
	setreg(&DMA2_Stream7->CR, 1, 4, bool);
}
void STM32FXXXDMA2_stream7_cr_htie(uint8_t bool)
{
	setreg(&DMA2_Stream7->CR, 1, 3, bool);
}
void STM32FXXXDMA2_stream7_cr_teie(uint8_t bool)
{
	setreg(&DMA2_Stream7->CR, 1, 2, bool);
}
void STM32FXXXDMA2_stream7_cr_dmeie(uint8_t bool)
{
	setreg(&DMA2_Stream7->CR, 1, 1, bool);
}
void STM32FXXXDMA2_stream7_cr_en(uint8_t bool)
{
	setreg(&DMA2_Stream7->CR, 1, 0, bool);
}
/*** Inic DMA2 STREAM7 CR ***/
STM32FXXXDMA_STREAM_cr* stm32fxxx_dma2_stream7_cr_inic(void)
{

	// CR
	stm32fxxx_dma2_stream7_cr.chsel = STM32FXXXDMA2_stream7_cr_chsel;
	stm32fxxx_dma2_stream7_cr.mburst = STM32FXXXDMA2_stream7_cr_mburst;
	stm32fxxx_dma2_stream7_cr.pburst = STM32FXXXDMA2_stream7_cr_pburst;
	stm32fxxx_dma2_stream7_cr.ct = STM32FXXXDMA2_stream7_cr_ct;
	stm32fxxx_dma2_stream7_cr.dbm = STM32FXXXDMA2_stream7_cr_dbm;
	stm32fxxx_dma2_stream7_cr.pl = STM32FXXXDMA2_stream7_cr_pl;
	stm32fxxx_dma2_stream7_cr.pincos = STM32FXXXDMA2_stream7_cr_pincos;
	stm32fxxx_dma2_stream7_cr.msize = STM32FXXXDMA2_stream7_cr_msize;
	stm32fxxx_dma2_stream7_cr.psize = STM32FXXXDMA2_stream7_cr_psize;
	stm32fxxx_dma2_stream7_cr.minc = STM32FXXXDMA2_stream7_cr_minc;
	stm32fxxx_dma2_stream7_cr.pinc = STM32FXXXDMA2_stream7_cr_pinc;
	stm32fxxx_dma2_stream7_cr.circ = STM32FXXXDMA2_stream7_cr_circ;
	stm32fxxx_dma2_stream7_cr.dir = STM32FXXXDMA2_stream7_cr_dir;
	stm32fxxx_dma2_stream7_cr.pfctrl = STM32FXXXDMA2_stream7_cr_pfctrl;
	stm32fxxx_dma2_stream7_cr.tcie = STM32FXXXDMA2_stream7_cr_tcie;
	stm32fxxx_dma2_stream7_cr.htie = STM32FXXXDMA2_stream7_cr_htie;
	stm32fxxx_dma2_stream7_cr.teie = STM32FXXXDMA2_stream7_cr_teie;
	stm32fxxx_dma2_stream7_cr.dmeie = STM32FXXXDMA2_stream7_cr_dmeie;
	stm32fxxx_dma2_stream7_cr.en = STM32FXXXDMA2_stream7_cr_en;
	return &stm32fxxx_dma2_stream7_cr;
}
/*** Inic DMA2 STREAM7 Function ***/
void stm32fxxx_dma2_stream7_ndt(uint16_t value)
{
	DMA2_Stream7->NDTR = value;
}
void stm32fxxx_dma2_stream7_par(volatile long unsigned int periferal_addr)
{
	DMA2_Stream7->PAR = periferal_addr;
}
void stm32fxxx_dma2_stream7_m0a(volatile long unsigned int mem0_addr)
{
	DMA2_Stream7->M0AR = mem0_addr;
}
void stm32fxxx_dma2_stream7_m1a(volatile long unsigned int mem1_addr)
{
	DMA2_Stream7->M1AR = mem1_addr;
}
// DMA2 STREAM0 FCR
void STM32FXXXDMA2_stream0_fcr_feie(uint8_t bool)
{
	setreg(&DMA2_Stream0->FCR, 1, 7, bool);
}
void STM32FXXXDMA2_stream0_fcr_fs(uint8_t value)
{
	setreg(&DMA2_Stream0->FCR, 3, 3, value);
}
void STM32FXXXDMA2_stream0_fcr_dmdis(uint8_t bool)
{
	setreg(&DMA2_Stream0->FCR, 1, 2, bool);
}
void STM32FXXXDMA2_stream0_fcr_fth(uint8_t value)
{
	setreg(&DMA2_Stream0->FCR, 2, 0, value);
}
/*** Inic DMA2 STREAM0 FCR ***/
STM32FXXXDMA_STREAM_fcr* stm32fxxx_dma2_stream0_fcr_inic(void)
{

	// FCR
	stm32fxxx_dma2_stream0_fcr.feie = STM32FXXXDMA2_stream0_fcr_feie;
	stm32fxxx_dma2_stream0_fcr.fs = STM32FXXXDMA2_stream0_fcr_fs;
	stm32fxxx_dma2_stream0_fcr.dmdis = STM32FXXXDMA2_stream0_fcr_dmdis;
	stm32fxxx_dma2_stream0_fcr.fth = STM32FXXXDMA2_stream0_fcr_fth;
	return &stm32fxxx_dma2_stream0_fcr;
}
// DMA2 STREAM1 FCR
void STM32FXXXDMA2_stream1_fcr_feie(uint8_t bool)
{
	setreg(&DMA2_Stream1->FCR, 1, 7, bool);
}
void STM32FXXXDMA2_stream1_fcr_fs(uint8_t value)
{
	setreg(&DMA2_Stream1->FCR, 3, 3, value);
}
void STM32FXXXDMA2_stream1_fcr_dmdis(uint8_t bool)
{
	setreg(&DMA2_Stream1->FCR, 1, 2, bool);
}
void STM32FXXXDMA2_stream1_fcr_fth(uint8_t value)
{
	setreg(&DMA2_Stream1->FCR, 2, 0, value);
}
/*** Inic DMA2 STREAM1 FCR ***/
STM32FXXXDMA_STREAM_fcr* stm32fxxx_dma2_stream1_fcr_inic(void)
{

	// FCR
	stm32fxxx_dma2_stream1_fcr.feie = STM32FXXXDMA2_stream1_fcr_feie;
	stm32fxxx_dma2_stream1_fcr.fs = STM32FXXXDMA2_stream1_fcr_fs;
	stm32fxxx_dma2_stream1_fcr.dmdis = STM32FXXXDMA2_stream1_fcr_dmdis;
	stm32fxxx_dma2_stream1_fcr.fth = STM32FXXXDMA2_stream1_fcr_fth;
	return &stm32fxxx_dma2_stream1_fcr;
}
// DMA2 STREAM2 FCR
void STM32FXXXDMA2_stream2_fcr_feie(uint8_t bool)
{
	setreg(&DMA2_Stream2->FCR, 1, 7, bool);
}
void STM32FXXXDMA2_stream2_fcr_fs(uint8_t value)
{
	setreg(&DMA2_Stream2->FCR, 3, 3, value);
}
void STM32FXXXDMA2_stream2_fcr_dmdis(uint8_t bool)
{
	setreg(&DMA2_Stream2->FCR, 1, 2, bool);
}
void STM32FXXXDMA2_stream2_fcr_fth(uint8_t value)
{
	setreg(&DMA2_Stream2->FCR, 2, 0, value);
}
/*** Inic DMA2 STREAM2 FCR ***/
STM32FXXXDMA_STREAM_fcr* stm32fxxx_dma2_stream2_fcr_inic(void)
{

	// FCR
	stm32fxxx_dma2_stream2_fcr.feie = STM32FXXXDMA2_stream2_fcr_feie;
	stm32fxxx_dma2_stream2_fcr.fs = STM32FXXXDMA2_stream2_fcr_fs;
	stm32fxxx_dma2_stream2_fcr.dmdis = STM32FXXXDMA2_stream2_fcr_dmdis;
	stm32fxxx_dma2_stream2_fcr.fth = STM32FXXXDMA2_stream2_fcr_fth;
	return &stm32fxxx_dma2_stream2_fcr;
}
// DMA2 STREAM3 FCR
void STM32FXXXDMA2_stream3_fcr_feie(uint8_t bool)
{
	setreg(&DMA2_Stream3->FCR, 1, 7, bool);
}
void STM32FXXXDMA2_stream3_fcr_fs(uint8_t value)
{
	setreg(&DMA2_Stream3->FCR, 3, 3, value);
}
void STM32FXXXDMA2_stream3_fcr_dmdis(uint8_t bool)
{
	setreg(&DMA2_Stream3->FCR, 1, 2, bool);
}
void STM32FXXXDMA2_stream3_fcr_fth(uint8_t value)
{
	setreg(&DMA2_Stream3->FCR, 2, 0, value);
}
/*** Inic DMA2 STREAM3 FCR ***/
STM32FXXXDMA_STREAM_fcr* stm32fxxx_dma2_stream3_fcr_inic(void)
{

	// FCR
	stm32fxxx_dma2_stream3_fcr.feie = STM32FXXXDMA2_stream3_fcr_feie;
	stm32fxxx_dma2_stream3_fcr.fs = STM32FXXXDMA2_stream3_fcr_fs;
	stm32fxxx_dma2_stream3_fcr.dmdis = STM32FXXXDMA2_stream3_fcr_dmdis;
	stm32fxxx_dma2_stream3_fcr.fth = STM32FXXXDMA2_stream3_fcr_fth;
	return &stm32fxxx_dma2_stream3_fcr;
}
// DMA1 STREAM4 FCR
void STM32FXXXDMA2_stream4_fcr_feie(uint8_t bool)
{
	setreg(&DMA2_Stream4->FCR, 1, 7, bool);
}
void STM32FXXXDMA2_stream4_fcr_fs(uint8_t value)
{
	setreg(&DMA2_Stream4->FCR, 3, 3, value);
}
void STM32FXXXDMA2_stream4_fcr_dmdis(uint8_t bool)
{
	setreg(&DMA2_Stream4->FCR, 1, 2, bool);
}
void STM32FXXXDMA2_stream4_fcr_fth(uint8_t value)
{
	setreg(&DMA2_Stream4->FCR, 2, 0, value);
}
/*** Inic DMA2 STREAM4 FCR ***/
STM32FXXXDMA_STREAM_fcr* stm32fxxx_dma2_stream4_fcr_inic(void)
{

	// FCR
	stm32fxxx_dma2_stream4_fcr.feie = STM32FXXXDMA2_stream4_fcr_feie;
	stm32fxxx_dma2_stream4_fcr.fs = STM32FXXXDMA2_stream4_fcr_fs;
	stm32fxxx_dma2_stream4_fcr.dmdis = STM32FXXXDMA2_stream4_fcr_dmdis;
	stm32fxxx_dma2_stream4_fcr.fth = STM32FXXXDMA2_stream4_fcr_fth;
	return &stm32fxxx_dma2_stream4_fcr;
}
// DMA1 STREAM5 FCR
void STM32FXXXDMA2_stream5_fcr_feie(uint8_t bool)
{
	setreg(&DMA2_Stream5->FCR, 1, 7, bool);
}
void STM32FXXXDMA2_stream5_fcr_fs(uint8_t value)
{
	setreg(&DMA2_Stream5->FCR, 3, 3, value);
}
void STM32FXXXDMA2_stream5_fcr_dmdis(uint8_t bool)
{
	setreg(&DMA2_Stream5->FCR, 1, 2, bool);
}
void STM32FXXXDMA2_stream5_fcr_fth(uint8_t value)
{
	setreg(&DMA2_Stream5->FCR, 2, 0, value);
}
/*** Inic DMA2 STREAM5 FCR ***/
STM32FXXXDMA_STREAM_fcr* stm32fxxx_dma2_stream5_fcr_inic(void)
{

	// FCR
	stm32fxxx_dma2_stream5_fcr.feie = STM32FXXXDMA2_stream5_fcr_feie;
	stm32fxxx_dma2_stream5_fcr.fs = STM32FXXXDMA2_stream5_fcr_fs;
	stm32fxxx_dma2_stream5_fcr.dmdis = STM32FXXXDMA2_stream5_fcr_dmdis;
	stm32fxxx_dma2_stream5_fcr.fth = STM32FXXXDMA2_stream5_fcr_fth;
	return &stm32fxxx_dma2_stream5_fcr;
}
// DMA1 STREAM6 FCR
void STM32FXXXDMA2_stream6_fcr_feie(uint8_t bool)
{
	setreg(&DMA2_Stream6->FCR, 1, 7, bool);
}
void STM32FXXXDMA2_stream6_fcr_fs(uint8_t value)
{
	setreg(&DMA2_Stream6->FCR, 3, 3, value);
}
void STM32FXXXDMA2_stream6_fcr_dmdis(uint8_t bool)
{
	setreg(&DMA2_Stream6->FCR, 1, 2, bool);
}
void STM32FXXXDMA2_stream6_fcr_fth(uint8_t value)
{
	setreg(&DMA2_Stream6->FCR, 2, 0, value);
}
/*** Inic DMA2 STREAM6 FCR ***/
STM32FXXXDMA_STREAM_fcr* stm32fxxx_dma2_stream6_fcr_inic(void)
{

	// FCR
	stm32fxxx_dma2_stream6_fcr.feie = STM32FXXXDMA2_stream6_fcr_feie;
	stm32fxxx_dma2_stream6_fcr.fs = STM32FXXXDMA2_stream6_fcr_fs;
	stm32fxxx_dma2_stream6_fcr.dmdis = STM32FXXXDMA2_stream6_fcr_dmdis;
	stm32fxxx_dma2_stream6_fcr.fth = STM32FXXXDMA2_stream6_fcr_fth;
	return &stm32fxxx_dma2_stream6_fcr;
}
// DMA2 STREAM0 FCR
void STM32FXXXDMA2_stream7_fcr_feie(uint8_t bool)
{
	setreg(&DMA2_Stream7->FCR, 1, 7, bool);
}
void STM32FXXXDMA2_stream7_fcr_fs(uint8_t value)
{
	setreg(&DMA2_Stream7->FCR, 3, 3, value);
}
void STM32FXXXDMA2_stream7_fcr_dmdis(uint8_t bool)
{
	setreg(&DMA2_Stream7->FCR, 1, 2, bool);
}
void STM32FXXXDMA2_stream7_fcr_fth(uint8_t value)
{
	setreg(&DMA2_Stream7->FCR, 2, 0, value);
}
/*** Inic DMA2 STREAM7 FCR ***/
STM32FXXXDMA_STREAM_fcr* stm32fxxx_dma2_stream7_fcr_inic(void)
{

